[Killed] BooleanLiteral
src/webhooks/handlers/check_run.ts:6:7
 export function handleCheckRunEvent(event: any) {
   const action = event.action as string;
   const check = event.check_run;
-  if (!check) return;
+  if (check) return;
   const name = check.name as string;
   const conclusion = check.conclusion as string | undefined; // success, failure, neutral, cancelled, etc.
killedBy: handlers early return branches handleCheckRunEvent early returns when payload missing check_run
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
src/webhooks/handlers/check_run.ts:6:7
 export function handleCheckRunEvent(event: any) {
   const action = event.action as string;
   const check = event.check_run;
-  if (!check) return;
+  if (false) return;
   const name = check.name as string;
   const conclusion = check.conclusion as string | undefined; // success, failure, neutral, cancelled, etc.
killedBy: handlers early return branches handleCheckRunEvent early returns when payload missing check_run
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
src/webhooks/handlers/check_run.ts:11:14
   const conclusion = check.conclusion as string | undefined; // success, failure, neutral, cancelled, etc.
 
   // Try to infer issue number from pull requests associated with the check
-  const pr = (check.pull_requests && check.pull_requests[0]) || undefined;
+  const pr = false;
   const pr_number = pr?.number as number | undefined;
   const repo = event.repository?.full_name as string;
killedBy: check_run cancelled marks CHECKS_RED sets red state on cancelled conclusion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "PR_OPEN"

[Killed] ConditionalExpression
src/webhooks/handlers/check_run.ts:11:14
   const conclusion = check.conclusion as string | undefined; // success, failure, neutral, cancelled, etc.
 
   // Try to infer issue number from pull requests associated with the check
-  const pr = (check.pull_requests && check.pull_requests[0]) || undefined;
+  const pr = true;
   const pr_number = pr?.number as number | undefined;
   const repo = event.repository?.full_name as string;
killedBy: check_run cancelled marks CHECKS_RED sets red state on cancelled conclusion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "PR_OPEN"

[Killed] ConditionalExpression
src/webhooks/handlers/check_run.ts:17:7
 
   // Best effort: parse issue number referenced in PR title/body
   let issue_number: number | undefined;
-  if (pr && pr.title) {
+  if (false) {
     const m = pr.title.match(/#(\d+)/);
     if (m) issue_number = Number(m[1]);
killedBy: handlers branch coverage check_run timed_out -> CHECKS_RED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "PR_OPEN"

[Killed] BlockStatement
src/webhooks/handlers/check_run.ts:17:23
 
   // Best effort: parse issue number referenced in PR title/body
   let issue_number: number | undefined;
-  if (pr && pr.title) {
-    const m = pr.title.match(/#(\d+)/);
-    if (m) issue_number = Number(m[1]);
-  }
+  if (pr && pr.title) {}
 
   if (!issue_number && pr && pr.body) {
killedBy: check_run cancelled marks CHECKS_RED sets red state on cancelled conclusion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "PR_OPEN"

[Killed] Regex
src/webhooks/handlers/check_run.ts:18:30
   // Best effort: parse issue number referenced in PR title/body
   let issue_number: number | undefined;
   if (pr && pr.title) {
-    const m = pr.title.match(/#(\d+)/);
+    const m = pr.title.match(/#(\d)/);
     if (m) issue_number = Number(m[1]);
   }
killedBy: check_run cancelled marks CHECKS_RED sets red state on cancelled conclusion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "PR_OPEN"

[Killed] Regex
src/webhooks/handlers/check_run.ts:18:30
   // Best effort: parse issue number referenced in PR title/body
   let issue_number: number | undefined;
   if (pr && pr.title) {
-    const m = pr.title.match(/#(\d+)/);
+    const m = pr.title.match(/#(\D+)/);
     if (m) issue_number = Number(m[1]);
   }
killedBy: handlers branch coverage check_run timed_out -> CHECKS_RED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "PR_OPEN"

[Killed] ConditionalExpression
src/webhooks/handlers/check_run.ts:19:9
   let issue_number: number | undefined;
   if (pr && pr.title) {
     const m = pr.title.match(/#(\d+)/);
-    if (m) issue_number = Number(m[1]);
+    if (false) issue_number = Number(m[1]);
   }
 
killedBy: check_run cancelled marks CHECKS_RED sets red state on cancelled conclusion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "PR_OPEN"

[Survived] ConditionalExpression
src/webhooks/handlers/check_run.ts:19:9
   let issue_number: number | undefined;
   if (pr && pr.title) {
     const m = pr.title.match(/#(\d+)/);
-    if (m) issue_number = Number(m[1]);
+    if (true) issue_number = Number(m[1]);
   }
 

[Killed] ConditionalExpression
src/webhooks/handlers/check_run.ts:22:7
     if (m) issue_number = Number(m[1]);
   }
 
-  if (!issue_number && pr && pr.body) {
+  if (true) {
     const m = pr.body.match(/#(\d+)/);
     if (m) issue_number = Number(m[1]);
killedBy: check_run cancelled marks CHECKS_RED sets red state on cancelled conclusion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "PR_OPEN"

[Survived] LogicalOperator
src/webhooks/handlers/check_run.ts:22:7
     if (m) issue_number = Number(m[1]);
   }
 
-  if (!issue_number && pr && pr.body) {
+  if (!issue_number || pr && pr.body) {
     const m = pr.body.match(/#(\d+)/);
     if (m) issue_number = Number(m[1]);

[NoCoverage] ConditionalExpression
src/webhooks/handlers/check_run.ts:24:9
 
   if (!issue_number && pr && pr.body) {
     const m = pr.body.match(/#(\d+)/);
-    if (m) issue_number = Number(m[1]);
+    if (true) issue_number = Number(m[1]);
   }
 

[NoCoverage] ConditionalExpression
src/webhooks/handlers/check_run.ts:24:9
 
   if (!issue_number && pr && pr.body) {
     const m = pr.body.match(/#(\d+)/);
-    if (m) issue_number = Number(m[1]);
+    if (false) issue_number = Number(m[1]);
   }
 

[Killed] BooleanLiteral
src/webhooks/handlers/check_run.ts:27:7
     if (m) issue_number = Number(m[1]);
   }
 
-  if (!issue_number) {
+  if (issue_number) {
     // no-op without issue linkage
     return;
killedBy: check_run cancelled marks CHECKS_RED sets red state on cancelled conclusion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "PR_OPEN"

[Killed] ConditionalExpression
src/webhooks/handlers/check_run.ts:27:7
     if (m) issue_number = Number(m[1]);
   }
 
-  if (!issue_number) {
+  if (true) {
     // no-op without issue linkage
     return;
killedBy: check_run cancelled marks CHECKS_RED sets red state on cancelled conclusion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "PR_OPEN"

[Killed] BlockStatement
src/webhooks/handlers/check_run.ts:34:19
 
   const rec = upsertTask({ issue_number, repo });
 
-  if (conclusion) {
-    const ok = conclusion === 'success';
-    setCheck(issue_number, name, ok);
-    if (rec.checks.green) {
-      setState(issue_number, 'CHECKS_GREEN');
-    } else if (conclusion === 'failure' || conclusion === 'cancelled' || conclusion === 'timed_out') {
-      setState(issue_number, 'CHECKS_RED');
-    }
-  }
+  if (conclusion) {}
 
   addEvent(issue_number, { ts: Date.now(), event: 'check_run', action, check_name: name, conclusion });
killedBy: handlers branch coverage check_run timed_out -> CHECKS_RED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "PR_OPEN"

[Killed] ConditionalExpression
src/webhooks/handlers/check_run.ts:34:7
 
   const rec = upsertTask({ issue_number, repo });
 
-  if (conclusion) {
+  if (false) {
     const ok = conclusion === 'success';
     setCheck(issue_number, name, ok);
killedBy: check_run cancelled marks CHECKS_RED sets red state on cancelled conclusion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "PR_OPEN"

[Survived] EqualityOperator
src/webhooks/handlers/check_run.ts:35:16
   const rec = upsertTask({ issue_number, repo });
 
   if (conclusion) {
-    const ok = conclusion === 'success';
+    const ok = conclusion !== 'success';
     setCheck(issue_number, name, ok);
     if (rec.checks.green) {

[Survived] ConditionalExpression
src/webhooks/handlers/check_run.ts:35:16
   const rec = upsertTask({ issue_number, repo });
 
   if (conclusion) {
-    const ok = conclusion === 'success';
+    const ok = false;
     setCheck(issue_number, name, ok);
     if (rec.checks.green) {

[Killed] ConditionalExpression
src/webhooks/handlers/check_run.ts:37:9
   if (conclusion) {
     const ok = conclusion === 'success';
     setCheck(issue_number, name, ok);
-    if (rec.checks.green) {
+    if (true) {
       setState(issue_number, 'CHECKS_GREEN');
     } else if (conclusion === 'failure' || conclusion === 'cancelled' || conclusion === 'timed_out') {
killedBy: check_run cancelled marks CHECKS_RED sets red state on cancelled conclusion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "CHECKS_GREEN"

[Survived] ConditionalExpression
src/webhooks/handlers/check_run.ts:37:9
   if (conclusion) {
     const ok = conclusion === 'success';
     setCheck(issue_number, name, ok);
-    if (rec.checks.green) {
+    if (false) {
       setState(issue_number, 'CHECKS_GREEN');
     } else if (conclusion === 'failure' || conclusion === 'cancelled' || conclusion === 'timed_out') {

[Killed] ConditionalExpression
src/webhooks/handlers/check_run.ts:39:44
     setCheck(issue_number, name, ok);
     if (rec.checks.green) {
       setState(issue_number, 'CHECKS_GREEN');
-    } else if (conclusion === 'failure' || conclusion === 'cancelled' || conclusion === 'timed_out') {
+    } else if (conclusion === 'failure' || false || conclusion === 'timed_out') {
       setState(issue_number, 'CHECKS_RED');
     }
killedBy: check_run cancelled marks CHECKS_RED sets red state on cancelled conclusion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "PR_OPEN"

[Killed] EqualityOperator
src/webhooks/handlers/check_run.ts:39:44
     setCheck(issue_number, name, ok);
     if (rec.checks.green) {
       setState(issue_number, 'CHECKS_GREEN');
-    } else if (conclusion === 'failure' || conclusion === 'cancelled' || conclusion === 'timed_out') {
+    } else if (conclusion === 'failure' || conclusion !== 'cancelled' || conclusion === 'timed_out') {
       setState(issue_number, 'CHECKS_RED');
     }
killedBy: check_run cancelled marks CHECKS_RED sets red state on cancelled conclusion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "PR_OPEN"

[Survived] ObjectLiteral
src/webhooks/handlers/check_run.ts:44:26
     }
   }
 
-  addEvent(issue_number, { ts: Date.now(), event: 'check_run', action, check_name: name, conclusion });
+  addEvent(issue_number, {});
 }
 
