[Timeout] StringLiteral
src/github/signature.ts:3:26
 import crypto from 'crypto';
 
-const SIGNATURE_PREFIX = 'sha256=';
+const SIGNATURE_PREFIX = "";
 
 export function verifySignature(headerValue: string | undefined, payload: string, secret: string): boolean {

[Killed] ConditionalExpression
src/github/signature.ts:6:7
 const SIGNATURE_PREFIX = 'sha256=';
 
 export function verifySignature(headerValue: string | undefined, payload: string, secret: string): boolean {
-  if (!headerValue || !secret) {
+  if (true) {
     return false;
   }
killedBy: orchestrator webhook valid signature is accepted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BooleanLiteral
src/github/signature.ts:6:23
 const SIGNATURE_PREFIX = 'sha256=';
 
 export function verifySignature(headerValue: string | undefined, payload: string, secret: string): boolean {
-  if (!headerValue || !secret) {
+  if (!headerValue || secret) {
     return false;
   }
killedBy: handlers branch coverage issues closed with merged true -> MERGED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BooleanLiteral
src/github/signature.ts:7:12
 
 export function verifySignature(headerValue: string | undefined, payload: string, secret: string): boolean {
   if (!headerValue || !secret) {
-    return false;
+    return true;
   }
 
killedBy: orchestrator webhook missing signature header is rejected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Killed] ConditionalExpression
src/github/signature.ts:10:7
     return false;
   }
 
-  if (!headerValue.startsWith(SIGNATURE_PREFIX)) {
+  if (true) {
     return false;
   }
killedBy: orchestrator webhook valid signature is accepted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] MethodExpression
src/github/signature.ts:10:8
     return false;
   }
 
-  if (!headerValue.startsWith(SIGNATURE_PREFIX)) {
+  if (!headerValue.endsWith(SIGNATURE_PREFIX)) {
     return false;
   }
killedBy: handlers branch coverage issues closed with merged true -> MERGED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BooleanLiteral
src/github/signature.ts:11:12
   }
 
   if (!headerValue.startsWith(SIGNATURE_PREFIX)) {
-    return false;
+    return true;
   }
 
killedBy: orchestrator webhook unsupported signature scheme is rejected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Killed] MethodExpression
src/github/signature.ts:14:20
     return false;
   }
 
-  const received = headerValue.substring(SIGNATURE_PREFIX.length);
+  const received = headerValue;
   const hmac = crypto.createHmac('sha256', secret);
   hmac.update(payload);
killedBy: orchestrator webhook valid signature is accepted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] StringLiteral
src/github/signature.ts:17:32
   const received = headerValue.substring(SIGNATURE_PREFIX.length);
   const hmac = crypto.createHmac('sha256', secret);
   hmac.update(payload);
-  const expected = hmac.digest('hex');
+  const expected = hmac.digest("");
 
   if (received.length !== expected.length) {
killedBy: orchestrator webhook valid signature is accepted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] EqualityOperator
src/github/signature.ts:19:7
   hmac.update(payload);
   const expected = hmac.digest('hex');
 
-  if (received.length !== expected.length) {
+  if (received.length === expected.length) {
     return false;
   }
killedBy: orchestrator webhook valid signature is accepted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] ConditionalExpression
src/github/signature.ts:19:7
   hmac.update(payload);
   const expected = hmac.digest('hex');
 
-  if (received.length !== expected.length) {
+  if (true) {
     return false;
   }
killedBy: orchestrator webhook valid signature is accepted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BooleanLiteral
src/github/signature.ts:20:12
   const expected = hmac.digest('hex');
 
   if (received.length !== expected.length) {
-    return false;
+    return true;
   }
 
killedBy: orchestrator webhook mismatched signature is rejected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Killed] BlockStatement
src/github/signature.ts:23:7
     return false;
   }
 
-  try {
-    const receivedBuffer = Buffer.from(received, 'hex');
-    const expectedBuffer = Buffer.from(expected, 'hex');
-    return crypto.timingSafeEqual(receivedBuffer, expectedBuffer);
-  } catch (error) {
+  try {} catch (error) {
     return false;
   }
killedBy: handlers branch coverage issues closed with merged true -> MERGED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[NoCoverage] BlockStatement
src/github/signature.ts:27:19
     const receivedBuffer = Buffer.from(received, 'hex');
     const expectedBuffer = Buffer.from(expected, 'hex');
     return crypto.timingSafeEqual(receivedBuffer, expectedBuffer);
-  } catch (error) {
-    return false;
-  }
+  } catch (error) {}
 }
 
