[Killed] ConditionalExpression
src/webhooks/handlers/issues.ts:6:7
 export function handleIssuesEvent(event: any) {
   const action = event.action as string;
   const issue = event.issue;
-  if (!issue) return;
+  if (true) return;
   const issue_number = issue.number as number;
   const repo = event.repository?.full_name as string;
killedBy: webhooks + state accepts issues opened and creates CREATED state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BooleanLiteral
src/webhooks/handlers/issues.ts:6:7
 export function handleIssuesEvent(event: any) {
   const action = event.action as string;
   const issue = event.issue;
-  if (!issue) return;
+  if (issue) return;
   const issue_number = issue.number as number;
   const repo = event.repository?.full_name as string;
killedBy: webhooks + state accepts issues opened and creates CREATED state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Survived] BlockStatement
src/webhooks/handlers/issues.ts:13:28
   upsertTask({ issue_number, repo });
 
   // CREATED when issue opened with ai-task label
-  if (action === 'opened') {
-    const labels: string[] = (issue.labels || []).map((l: any) => l.name);
-    if (labels.includes('ai-task')) {
-      setState(issue_number, 'CREATED');
-    }
-  }
+  if (action === 'opened') {}
 
   if (action === 'closed') {

[Survived] EqualityOperator
src/webhooks/handlers/issues.ts:13:7
   upsertTask({ issue_number, repo });
 
   // CREATED when issue opened with ai-task label
-  if (action === 'opened') {
+  if (action !== 'opened') {
     const labels: string[] = (issue.labels || []).map((l: any) => l.name);
     if (labels.includes('ai-task')) {

[Killed] ConditionalExpression
src/webhooks/handlers/issues.ts:14:31
 
   // CREATED when issue opened with ai-task label
   if (action === 'opened') {
-    const labels: string[] = (issue.labels || []).map((l: any) => l.name);
+    const labels: string[] = (true).map((l: any) => l.name);
     if (labels.includes('ai-task')) {
       setState(issue_number, 'CREATED');
killedBy: state store + handlers issues closed without merge → FAILED
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value).map is not a function

[Killed] ConditionalExpression
src/webhooks/handlers/issues.ts:14:31
 
   // CREATED when issue opened with ai-task label
   if (action === 'opened') {
-    const labels: string[] = (issue.labels || []).map((l: any) => l.name);
+    const labels: string[] = (false).map((l: any) => l.name);
     if (labels.includes('ai-task')) {
       setState(issue_number, 'CREATED');
killedBy: state store + handlers issues closed without merge → FAILED
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value).map is not a function

[Survived] ConditionalExpression
src/webhooks/handlers/issues.ts:15:9
   // CREATED when issue opened with ai-task label
   if (action === 'opened') {
     const labels: string[] = (issue.labels || []).map((l: any) => l.name);
-    if (labels.includes('ai-task')) {
+    if (false) {
       setState(issue_number, 'CREATED');
     }

[Survived] ConditionalExpression
src/webhooks/handlers/issues.ts:15:9
   // CREATED when issue opened with ai-task label
   if (action === 'opened') {
     const labels: string[] = (issue.labels || []).map((l: any) => l.name);
-    if (labels.includes('ai-task')) {
+    if (true) {
       setState(issue_number, 'CREATED');
     }

[Killed] StringLiteral
src/webhooks/handlers/issues.ts:16:30
   if (action === 'opened') {
     const labels: string[] = (issue.labels || []).map((l: any) => l.name);
     if (labels.includes('ai-task')) {
-      setState(issue_number, 'CREATED');
+      setState(issue_number, "");
     }
   }
killedBy: webhooks + state accepts issues opened and creates CREATED state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CREATED"
Received: ""

[Killed] BlockStatement
src/webhooks/handlers/issues.ts:20:28
     }
   }
 
-  if (action === 'closed') {
-    if (issue.pull_request && issue.pull_request.merged) {
-      setState(issue_number, 'MERGED');
-    } else {
-      setState(issue_number, 'FAILED');
-    }
-  }
+  if (action === 'closed') {}
 
   addEvent(issue_number, { ts: Date.now(), event: 'issues', action });
killedBy: handlers branch coverage issues closed with merged true -> MERGED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MERGED"
Received: "CREATED"

[Killed] ConditionalExpression
src/webhooks/handlers/issues.ts:20:7
     }
   }
 
-  if (action === 'closed') {
+  if (true) {
     if (issue.pull_request && issue.pull_request.merged) {
       setState(issue_number, 'MERGED');
killedBy: issues opened without ai-task label exercises false branch does not alter state beyond upsert default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CREATED"
Received: "FAILED"

[Killed] BlockStatement
src/webhooks/handlers/issues.ts:21:58
   }
 
   if (action === 'closed') {
-    if (issue.pull_request && issue.pull_request.merged) {
-      setState(issue_number, 'MERGED');
-    } else {
+    if (issue.pull_request && issue.pull_request.merged) {} else {
       setState(issue_number, 'FAILED');
     }
killedBy: handlers branch coverage issues closed with merged true -> MERGED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MERGED"
Received: "CREATED"

[Killed] ConditionalExpression
src/webhooks/handlers/issues.ts:21:9
   }
 
   if (action === 'closed') {
-    if (issue.pull_request && issue.pull_request.merged) {
+    if (false) {
       setState(issue_number, 'MERGED');
     } else {
killedBy: handlers branch coverage issues closed with merged true -> MERGED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MERGED"
Received: "FAILED"

[Timeout] BlockStatement
src/webhooks/handlers/issues.ts:23:12
   if (action === 'closed') {
     if (issue.pull_request && issue.pull_request.merged) {
       setState(issue_number, 'MERGED');
-    } else {
-      setState(issue_number, 'FAILED');
-    }
+    } else {}
   }
 
