[Killed] BlockStatement
src/server.ts:34:71
   body?: unknown;
 }
 
-export function extractRawBody(request: RequestForExtraction): string {
-  if (typeof request.rawBody === 'string') {
-    return request.rawBody;
-  }
-
-  if (request.body) {
-    if (typeof request.body === 'string') {
-      return request.body;
-    }
-    try {
-      return JSON.stringify(request.body);
-    } catch (_error) {
-      return '';
-    }
-  }
-
-  return '';
-}
+export function extractRawBody(request: RequestForExtraction): string {}
 
 export function buildWebhookLogPayload(event: string, deliveryId: string, payload: unknown): WebhookLogPayload {
killedBy: handlers branch coverage issues closed with merged true -> MERGED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
src/server.ts:35:7
 }
 
 export function extractRawBody(request: RequestForExtraction): string {
-  if (typeof request.rawBody === 'string') {
+  if (true) {
     return request.rawBody;
   }
killedBy: server branches and handler edges accepts non-json content-type and skips handler dispatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
src/server.ts:35:7
 }
 
 export function extractRawBody(request: RequestForExtraction): string {
-  if (typeof request.rawBody === 'string') {
+  if (false) {
     return request.rawBody;
   }
killedBy: orchestrator webhook empty payload passes signature validation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] ConditionalExpression
src/server.ts:39:7
     return request.rawBody;
   }
 
-  if (request.body) {
+  if (false) {
     if (typeof request.body === 'string') {
       return request.body;
killedBy: orchestrator webhook non-json content falls back to body serialization and is rejected when signature mismatches
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BlockStatement
src/server.ts:39:21
     return request.rawBody;
   }
 
-  if (request.body) {
-    if (typeof request.body === 'string') {
-      return request.body;
-    }
-    try {
-      return JSON.stringify(request.body);
-    } catch (_error) {
-      return '';
-    }
-  }
+  if (request.body) {}
 
   return '';
killedBy: server branches and handler edges accepts non-json content-type and skips handler dispatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] EqualityOperator
src/server.ts:40:9
   }
 
   if (request.body) {
-    if (typeof request.body === 'string') {
+    if (typeof request.body !== 'string') {
       return request.body;
     }
killedBy: orchestrator webhook non-json content falls back to body serialization and is rejected when signature mismatches
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BlockStatement
src/server.ts:40:43
   }
 
   if (request.body) {
-    if (typeof request.body === 'string') {
-      return request.body;
-    }
+    if (typeof request.body === 'string') {}
     try {
       return JSON.stringify(request.body);
killedBy: orchestrator webhook non-json content falls back to body serialization and is rejected when signature mismatches
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BlockStatement
src/server.ts:43:9
     if (typeof request.body === 'string') {
       return request.body;
     }
-    try {
-      return JSON.stringify(request.body);
-    } catch (_error) {
+    try {} catch (_error) {
       return '';
     }
killedBy: helpers extractRawBody handles strings and JSON
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"count\":1}"
Received: ""

[Survived] BlockStatement
src/server.ts:45:22
     }
     try {
       return JSON.stringify(request.body);
-    } catch (_error) {
-      return '';
-    }
+    } catch (_error) {}
   }
 

[Killed] StringLiteral
src/server.ts:50:10
     }
   }
 
-  return '';
+  return "Stryker was here!";
 }
 
killedBy: helpers extractRawBody handles strings and JSON
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] BlockStatement
src/server.ts:53:112
   return '';
 }
 
-export function buildWebhookLogPayload(event: string, deliveryId: string, payload: unknown): WebhookLogPayload {
-  const parsed = webhookSummarySchema.safeParse(payload);
-  const repo = parsed.success && parsed.data.repository ? parsed.data.repository.full_name : 'unknown';
-
-  return {
-    event,
-    repo,
-    deliveryId,
-  };
-}
+export function buildWebhookLogPayload(event: string, deliveryId: string, payload: unknown): WebhookLogPayload {}
 
 export function rateLimitErrorResponse() {
killedBy: orchestrator webhook structured log only includes summary fields
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/server.ts:55:16
 
 export function buildWebhookLogPayload(event: string, deliveryId: string, payload: unknown): WebhookLogPayload {
   const parsed = webhookSummarySchema.safeParse(payload);
-  const repo = parsed.success && parsed.data.repository ? parsed.data.repository.full_name : 'unknown';
+  const repo = true ? parsed.data.repository.full_name : 'unknown';
 
   return {
killedBy: orchestrator webhook empty payload passes signature validation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
src/server.ts:55:16
 
 export function buildWebhookLogPayload(event: string, deliveryId: string, payload: unknown): WebhookLogPayload {
   const parsed = webhookSummarySchema.safeParse(payload);
-  const repo = parsed.success && parsed.data.repository ? parsed.data.repository.full_name : 'unknown';
+  const repo = false ? parsed.data.repository.full_name : 'unknown';
 
   return {
killedBy: orchestrator webhook structured log only includes summary fields
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "deliveryId": "delivery-log",
    "event": "issues",

[Timeout] ObjectLiteral
src/server.ts:57:10
   const parsed = webhookSummarySchema.safeParse(payload);
   const repo = parsed.success && parsed.data.repository ? parsed.data.repository.full_name : 'unknown';
 
-  return {
-    event,
-    repo,
-    deliveryId,
-  };
+  return {};
 }
 

[Killed] BlockStatement
src/server.ts:64:42
   };
 }
 
-export function rateLimitErrorResponse() {
-  return { status: 'rate_limited' } as const;
-}
+export function rateLimitErrorResponse() {}
 
 interface RateLimitState {
killedBy: orchestrator webhook exceeding rate limit returns 429
statusReason: SyntaxError: Unexpected end of JSON input

[Killed] ArrayDeclaration
src/server.ts:73:50
   resetAt: number;
 }
 
-const TIME_MULTIPLIERS = new Map<string, number>([
-  ['ms', 1],
-  ['millisecond', 1],
-  ['milliseconds', 1],
-  ['s', 1000],
-  ['sec', 1000],
-  ['second', 1000],
-  ['seconds', 1000],
-  ['m', 60_000],
-  ['min', 60_000],
-  ['minute', 60_000],
-  ['minutes', 60_000],
-]);
+const TIME_MULTIPLIERS = new Map<string, number>([]);
 
 export function resolveTimeWindowMs(window: string | number): number {
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 250
Received: 60000

[Killed] ArrayDeclaration
src/server.ts:75:3
 
 const TIME_MULTIPLIERS = new Map<string, number>([
   ['ms', 1],
-  ['millisecond', 1],
+  [],
   ['milliseconds', 1],
   ['s', 1000],
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 60000

[Killed] StringLiteral
src/server.ts:75:4
 
 const TIME_MULTIPLIERS = new Map<string, number>([
   ['ms', 1],
-  ['millisecond', 1],
+  ["", 1],
   ['milliseconds', 1],
   ['s', 1000],
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 60000

[Killed] StringLiteral
src/server.ts:76:4
 const TIME_MULTIPLIERS = new Map<string, number>([
   ['ms', 1],
   ['millisecond', 1],
-  ['milliseconds', 1],
+  ["", 1],
   ['s', 1000],
   ['sec', 1000],
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 60000

[Killed] ArrayDeclaration
src/server.ts:82:3
   ['second', 1000],
   ['seconds', 1000],
   ['m', 60_000],
-  ['min', 60_000],
+  [],
   ['minute', 60_000],
   ['minutes', 60_000],
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 180000
Received: 60000

[Killed] StringLiteral
src/server.ts:84:4
   ['m', 60_000],
   ['min', 60_000],
   ['minute', 60_000],
-  ['minutes', 60_000],
+  ["", 60_000],
 ]);
 
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120000
Received: 60000

[Killed] BlockStatement
src/server.ts:87:70
   ['minutes', 60_000],
 ]);
 
-export function resolveTimeWindowMs(window: string | number): number {
-  if (typeof window === 'number' && Number.isFinite(window)) {
-    return Math.max(1, Math.round(window));
-  }
-
-  const normalized = window.toString().trim().toLowerCase();
-
-  if (/^\d+$/.test(normalized)) {
-    return Math.max(1, Number(normalized));
-  }
-
-  const match = normalized.match(/^(\d+(?:\.\d+)?)\s*(\w+)$/);
-  if (!match) {
-    return 60_000;
-  }
-
-  const value = Number(match[1]);
-  const multiplier = TIME_MULTIPLIERS.get(match[2]);
-  if (!multiplier) {
-    return 60_000;
-  }
-
-  return Math.max(1, Math.round(value * multiplier));
-}
+export function resolveTimeWindowMs(window: string | number): number {}
 
 export function createRateLimiter(config: WebhookRateLimit) {
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 250
Received: undefined

[Killed] ConditionalExpression
src/server.ts:88:7
 ]);
 
 export function resolveTimeWindowMs(window: string | number): number {
-  if (typeof window === 'number' && Number.isFinite(window)) {
+  if (true) {
     return Math.max(1, Math.round(window));
   }
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 250
Received: NaN

[Survived] BlockStatement
src/server.ts:88:62
 ]);
 
 export function resolveTimeWindowMs(window: string | number): number {
-  if (typeof window === 'number' && Number.isFinite(window)) {
-    return Math.max(1, Math.round(window));
-  }
+  if (typeof window === 'number' && Number.isFinite(window)) {}
 
   const normalized = window.toString().trim().toLowerCase();

[Timeout] MethodExpression
src/server.ts:89:12
 
 export function resolveTimeWindowMs(window: string | number): number {
   if (typeof window === 'number' && Number.isFinite(window)) {
-    return Math.max(1, Math.round(window));
+    return Math.min(1, Math.round(window));
   }
 

[Killed] MethodExpression
src/server.ts:92:22
     return Math.max(1, Math.round(window));
   }
 
-  const normalized = window.toString().trim().toLowerCase();
+  const normalized = window.toString().trim().toUpperCase();
 
   if (/^\d+$/.test(normalized)) {
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 250
Received: 60000

[Survived] MethodExpression
src/server.ts:92:22
     return Math.max(1, Math.round(window));
   }
 
-  const normalized = window.toString().trim().toLowerCase();
+  const normalized = window.toString().toLowerCase();
 
   if (/^\d+$/.test(normalized)) {

[Killed] ConditionalExpression
src/server.ts:94:7
 
   const normalized = window.toString().trim().toLowerCase();
 
-  if (/^\d+$/.test(normalized)) {
+  if (false) {
     return Math.max(1, Number(normalized));
   }
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4000
Received: 60000

[Killed] ConditionalExpression
src/server.ts:94:7
 
   const normalized = window.toString().trim().toLowerCase();
 
-  if (/^\d+$/.test(normalized)) {
+  if (true) {
     return Math.max(1, Number(normalized));
   }
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 250
Received: NaN

[Timeout] MethodExpression
src/server.ts:95:12
   const normalized = window.toString().trim().toLowerCase();
 
   if (/^\d+$/.test(normalized)) {
-    return Math.max(1, Number(normalized));
+    return Math.min(1, Number(normalized));
   }
 

[Killed] Regex
src/server.ts:98:34
     return Math.max(1, Number(normalized));
   }
 
-  const match = normalized.match(/^(\d+(?:\.\d+)?)\s*(\w+)$/);
+  const match = normalized.match(/^(\d+(?:\.\d+)?)\s*(\W+)$/);
   if (!match) {
     return 60_000;
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 250
Received: 60000

[Timeout] Regex
src/server.ts:98:34
     return Math.max(1, Number(normalized));
   }
 
-  const match = normalized.match(/^(\d+(?:\.\d+)?)\s*(\w+)$/);
+  const match = normalized.match(/^(\d+(?:\.\d+))\s*(\w+)$/);
   if (!match) {
     return 60_000;

[Killed] BooleanLiteral
src/server.ts:99:7
   }
 
   const match = normalized.match(/^(\d+(?:\.\d+)?)\s*(\w+)$/);
-  if (!match) {
+  if (match) {
     return 60_000;
   }
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 250
Received: 60000

[Killed] ConditionalExpression
src/server.ts:99:7
   }
 
   const match = normalized.match(/^(\d+(?:\.\d+)?)\s*(\w+)$/);
-  if (!match) {
+  if (true) {
     return 60_000;
   }
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 250
Received: 60000

[Killed] ConditionalExpression
src/server.ts:105:7
 
   const value = Number(match[1]);
   const multiplier = TIME_MULTIPLIERS.get(match[2]);
-  if (!multiplier) {
+  if (false) {
     return 60_000;
   }
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 60000
Received: NaN

[Killed] BlockStatement
src/server.ts:105:20
 
   const value = Number(match[1]);
   const multiplier = TIME_MULTIPLIERS.get(match[2]);
-  if (!multiplier) {
-    return 60_000;
-  }
+  if (!multiplier) {}
 
   return Math.max(1, Math.round(value * multiplier));
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 60000
Received: NaN

[Killed] ArithmeticOperator
src/server.ts:109:33
     return 60_000;
   }
 
-  return Math.max(1, Math.round(value * multiplier));
+  return Math.max(1, Math.round(value / multiplier));
 }
 
killedBy: rate limiter internals resolveTimeWindowMs covers supported formats
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1500
Received: 1

[Killed] MethodExpression
src/server.ts:109:10
     return 60_000;
   }
 
-  return Math.max(1, Math.round(value * multiplier));
+  return Math.min(1, Math.round(value * multiplier));
 }
 
killedBy: orchestrator webhook exceeding rate limit returns 429
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 429
Received: 200

[Killed] BlockStatement
src/server.ts:112:61
   return Math.max(1, Math.round(value * multiplier));
 }
 
-export function createRateLimiter(config: WebhookRateLimit) {
-  const limit = Math.max(1, config.max);
-  const windowMs = resolveTimeWindowMs(config.timeWindow);
-  const state = new Map<string, RateLimitState>();
-
-  return (request: FastifyRequest): boolean => {
-    const key = request.ip ?? 'unknown';
-    const now = Date.now();
-    const current = state.get(key);
-
-    if (!current || now >= current.resetAt) {
-      state.set(key, { count: 1, resetAt: now + windowMs });
-      return true;
-    }
-
-    if (current.count >= limit) {
-      return false;
-    }
-
-    current.count += 1;
-    return true;
-  };
-}
+export function createRateLimiter(config: WebhookRateLimit) {}
 
 export function firstHeaderValue(value: string | string[] | undefined): string | undefined {
killedBy: server branches and handler edges internal rate limiter returns false on second hit with max=1
statusReason: TypeError: limiter is not a function

[Killed] MethodExpression
src/server.ts:113:17
 }
 
 export function createRateLimiter(config: WebhookRateLimit) {
-  const limit = Math.max(1, config.max);
+  const limit = Math.min(1, config.max);
   const windowMs = resolveTimeWindowMs(config.timeWindow);
   const state = new Map<string, RateLimitState>();
killedBy: orchestrator webhook exceeding rate limit returns 429
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 429

[Killed] BlockStatement
src/server.ts:117:48
   const windowMs = resolveTimeWindowMs(config.timeWindow);
   const state = new Map<string, RateLimitState>();
 
-  return (request: FastifyRequest): boolean => {
-    const key = request.ip ?? 'unknown';
-    const now = Date.now();
-    const current = state.get(key);
-
-    if (!current || now >= current.resetAt) {
-      state.set(key, { count: 1, resetAt: now + windowMs });
-      return true;
-    }
-
-    if (current.count >= limit) {
-      return false;
-    }
-
-    current.count += 1;
-    return true;
-  };
+  return (request: FastifyRequest): boolean => {};
 }
 
killedBy: orchestrator webhook valid signature is accepted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 429

[Survived] LogicalOperator
src/server.ts:118:17
   const state = new Map<string, RateLimitState>();
 
   return (request: FastifyRequest): boolean => {
-    const key = request.ip ?? 'unknown';
+    const key = request.ip && 'unknown';
     const now = Date.now();
     const current = state.get(key);

[Killed] BlockStatement
src/server.ts:122:45
     const now = Date.now();
     const current = state.get(key);
 
-    if (!current || now >= current.resetAt) {
-      state.set(key, { count: 1, resetAt: now + windowMs });
-      return true;
-    }
+    if (!current || now >= current.resetAt) {}
 
     if (current.count >= limit) {
killedBy: orchestrator webhook valid signature is accepted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BooleanLiteral
src/server.ts:122:9
     const now = Date.now();
     const current = state.get(key);
 
-    if (!current || now >= current.resetAt) {
+    if (current || now >= current.resetAt) {
       state.set(key, { count: 1, resetAt: now + windowMs });
       return true;
killedBy: server branches and handler edges internal rate limiter returns false on second hit with max=1
statusReason: TypeError: Cannot read properties of undefined (reading 'resetAt')

[Killed] ArithmeticOperator
src/server.ts:123:43
     const current = state.get(key);
 
     if (!current || now >= current.resetAt) {
-      state.set(key, { count: 1, resetAt: now + windowMs });
+      state.set(key, { count: 1, resetAt: now - windowMs });
       return true;
     }
killedBy: orchestrator webhook exceeding rate limit returns 429
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 429
Received: 200

[Killed] ObjectLiteral
src/server.ts:123:22
     const current = state.get(key);
 
     if (!current || now >= current.resetAt) {
-      state.set(key, { count: 1, resetAt: now + windowMs });
+      state.set(key, {});
       return true;
     }
killedBy: orchestrator webhook exceeding rate limit returns 429
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 429
Received: 200

[Killed] BooleanLiteral
src/server.ts:124:14
 
     if (!current || now >= current.resetAt) {
       state.set(key, { count: 1, resetAt: now + windowMs });
-      return true;
+      return false;
     }
 
killedBy: orchestrator webhook valid signature is accepted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 429

[Killed] EqualityOperator
src/server.ts:127:9
       return true;
     }
 
-    if (current.count >= limit) {
+    if (current.count < limit) {
       return false;
     }
killedBy: orchestrator webhook exceeding rate limit returns 429
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 429

[Killed] BlockStatement
src/server.ts:127:33
       return true;
     }
 
-    if (current.count >= limit) {
-      return false;
-    }
+    if (current.count >= limit) {}
 
     current.count += 1;
killedBy: server branches and handler edges internal rate limiter returns false on second hit with max=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/server.ts:128:14
     }
 
     if (current.count >= limit) {
-      return false;
+      return true;
     }
 
killedBy: orchestrator webhook exceeding rate limit returns 429
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 429
Received: 200

[Killed] AssignmentOperator
src/server.ts:131:5
       return false;
     }
 
-    current.count += 1;
+    current.count -= 1;
     return true;
   };
killedBy: orchestrator webhook exceeding rate limit returns 429
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 429
Received: 200

[Killed] BooleanLiteral
src/server.ts:132:12
     }
 
     current.count += 1;
-    return true;
+    return false;
   };
 }
killedBy: orchestrator webhook exceeding rate limit returns 429
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 429

[Killed] BlockStatement
src/server.ts:136:92
   };
 }
 
-export function firstHeaderValue(value: string | string[] | undefined): string | undefined {
-  if (Array.isArray(value)) {
-    return value[0];
-  }
-
-  return value;
-}
+export function firstHeaderValue(value: string | string[] | undefined): string | undefined {}
 
 export function buildServer(config: AppConfig): FastifyInstance {
killedBy: orchestrator webhook valid signature is accepted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] ConditionalExpression
src/server.ts:137:7
 }
 
 export function firstHeaderValue(value: string | string[] | undefined): string | undefined {
-  if (Array.isArray(value)) {
+  if (false) {
     return value[0];
   }
killedBy: server branches and handler edges helper utilities cover corner cases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a"
Received: ["a", "b"]

[Killed] ConditionalExpression
src/server.ts:137:7
 }
 
 export function firstHeaderValue(value: string | string[] | undefined): string | undefined {
-  if (Array.isArray(value)) {
+  if (true) {
     return value[0];
   }
killedBy: server branches and handler edges returns 400 when event header missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] MethodExpression
src/server.ts:145:67
 }
 
 export function buildServer(config: AppConfig): FastifyInstance {
-  const envLogLevel = typeof process.env.LOG_LEVEL === 'string' ? process.env.LOG_LEVEL.trim() : undefined;
+  const envLogLevel = typeof process.env.LOG_LEVEL === 'string' ? process.env.LOG_LEVEL : undefined;
   const loggerLevel = envLogLevel && envLogLevel.length > 0 ? envLogLevel : 'info';
 
killedBy: orchestrator webhook logger falls back to info when LOG_LEVEL empty
statusReason: Error: default level:    must be included in custom levels

[Killed] ConditionalExpression
src/server.ts:145:23
 }
 
 export function buildServer(config: AppConfig): FastifyInstance {
-  const envLogLevel = typeof process.env.LOG_LEVEL === 'string' ? process.env.LOG_LEVEL.trim() : undefined;
+  const envLogLevel = false ? process.env.LOG_LEVEL.trim() : undefined;
   const loggerLevel = envLogLevel && envLogLevel.length > 0 ? envLogLevel : 'info';
 
killedBy: orchestrator webhook logger respects LOG_LEVEL override
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "debug"
Received: "info"

[Killed] ConditionalExpression
src/server.ts:146:23
 
 export function buildServer(config: AppConfig): FastifyInstance {
   const envLogLevel = typeof process.env.LOG_LEVEL === 'string' ? process.env.LOG_LEVEL.trim() : undefined;
-  const loggerLevel = envLogLevel && envLogLevel.length > 0 ? envLogLevel : 'info';
+  const loggerLevel = false ? envLogLevel : 'info';
 
   const baseLogger = pino({
killedBy: orchestrator webhook logger respects LOG_LEVEL override
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "debug"
Received: "info"

[Killed] EqualityOperator
src/server.ts:146:38
 
 export function buildServer(config: AppConfig): FastifyInstance {
   const envLogLevel = typeof process.env.LOG_LEVEL === 'string' ? process.env.LOG_LEVEL.trim() : undefined;
-  const loggerLevel = envLogLevel && envLogLevel.length > 0 ? envLogLevel : 'info';
+  const loggerLevel = envLogLevel && envLogLevel.length <= 0 ? envLogLevel : 'info';
 
   const baseLogger = pino({
killedBy: orchestrator webhook logger respects LOG_LEVEL override
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "debug"
Received: "info"

[Survived] ArrayDeclaration
src/server.ts:150:13
 
   const baseLogger = pino({
     level: loggerLevel,
-    redact: ['req.headers.authorization'],
+    redact: [],
   });
 

[Killed] ConditionalExpression
src/server.ts:161:30
     max: 100,
     timeWindow: '1 minute',
   };
-  const useInternalLimiter = process.env.RATE_LIMIT_MODE === 'internal';
+  const useInternalLimiter = true;
   const enforceRateLimit = useInternalLimiter ? createRateLimiter(rateLimitConfig) : undefined;
 
killedBy: orchestrator webhook route-level rate limit configuration honours environment overrides
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/server.ts:161:30
     max: 100,
     timeWindow: '1 minute',
   };
-  const useInternalLimiter = process.env.RATE_LIMIT_MODE === 'internal';
+  const useInternalLimiter = process.env.RATE_LIMIT_MODE !== 'internal';
   const enforceRateLimit = useInternalLimiter ? createRateLimiter(rateLimitConfig) : undefined;
 
killedBy: orchestrator webhook exceeding rate limit returns 429
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 429
Received: 200

[Survived] BooleanLiteral
src/server.ts:165:13
   const enforceRateLimit = useInternalLimiter ? createRateLimiter(rateLimitConfig) : undefined;
 
   void app.register(rateLimit, {
-    global: false,
+    global: true,
     ban: 0,
   });

[Killed] LogicalOperator
src/server.ts:169:39
     ban: 0,
   });
 
-  const routeMaxEnv = Number.parseInt(process.env.RATE_LIMIT_MAX ?? '', 10);
+  const routeMaxEnv = Number.parseInt(process.env.RATE_LIMIT_MAX && '', 10);
   const routeRateLimit: FastifyRateLimitOptions = {
     max: Number.isNaN(routeMaxEnv) ? rateLimitConfig.max : Math.max(1, routeMaxEnv),
killedBy: orchestrator webhook route-level rate limit configuration honours environment overrides
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 100

[Killed] MethodExpression
src/server.ts:171:60
 
   const routeMaxEnv = Number.parseInt(process.env.RATE_LIMIT_MAX ?? '', 10);
   const routeRateLimit: FastifyRateLimitOptions = {
-    max: Number.isNaN(routeMaxEnv) ? rateLimitConfig.max : Math.max(1, routeMaxEnv),
+    max: Number.isNaN(routeMaxEnv) ? rateLimitConfig.max : Math.min(1, routeMaxEnv),
     timeWindow: resolveTimeWindowMs(rateLimitConfig.timeWindow),
   };
killedBy: orchestrator webhook route-level rate limit configuration honours environment overrides
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Timeout] BlockStatement
src/server.ts:178:96
   app.decorate('orchestratorRateLimit', routeRateLimit);
   app.decorate('orchestratorInternalLimiter', useInternalLimiter);
 
-  app.addContentTypeParser('application/json', { parseAs: 'string' }, (request, body, done) => {
-    const bodyString = body as string;
-    request.rawBody = bodyString;
-
-    if (!bodyString) {
-      done(null, {});
-      return;
-    }
-
-    try {
-      const json = JSON.parse(bodyString);
-      done(null, json);
-    } catch (error) {
-      done(null, undefined);
-    }
-  });
+  app.addContentTypeParser('application/json', { parseAs: 'string' }, (request, body, done) => {});
 
   app.get('/healthz', async (_request, reply) => {
