[Killed] BooleanLiteral
src/server.ts:182:9
     const bodyString = body as string;
     request.rawBody = bodyString;
 
-    if (!bodyString) {
+    if (bodyString) {
       done(null, {});
       return;
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ConditionalExpression
src/server.ts:182:9
     const bodyString = body as string;
     request.rawBody = bodyString;
 
-    if (!bodyString) {
+    if (true) {
       done(null, {});
       return;
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Timeout] BlockStatement
src/server.ts:187:9
       return;
     }
 
-    try {
-      const json = JSON.parse(bodyString);
-      done(null, json);
-    } catch (error) {
+    try {} catch (error) {
       done(null, undefined);
     }

[Timeout] BlockStatement
src/server.ts:190:21
     try {
       const json = JSON.parse(bodyString);
       done(null, json);
-    } catch (error) {
-      done(null, undefined);
-    }
+    } catch (error) {}
   });
 

[Killed] BlockStatement
src/server.ts:195:50
     }
   });
 
-  app.get('/healthz', async (_request, reply) => {
-    return reply.send({ status: 'ok' });
-  });
+  app.get('/healthz', async (_request, reply) => {});
 
   app.post(
killedBy: orchestrator webhook health endpoint responds with ok
statusReason: SyntaxError: Unexpected end of JSON input

[Killed] StringLiteral
src/server.ts:196:33
   });
 
   app.get('/healthz', async (_request, reply) => {
-    return reply.send({ status: 'ok' });
+    return reply.send({ status: "" });
   });
 
killedBy: orchestrator webhook health endpoint responds with ok
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "status": "ok",
+   "status": "",

[Killed] ObjectLiteral
src/server.ts:196:23
   });
 
   app.get('/healthz', async (_request, reply) => {
-    return reply.send({ status: 'ok' });
+    return reply.send({});
   });
 
killedBy: orchestrator webhook health endpoint responds with ok
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "status": "ok",
- }

[Killed] BlockStatement
src/server.ts:207:39
       },
       preHandler: useInternalLimiter
         ? [
-            async (request, reply) => {
-              if (enforceRateLimit && !enforceRateLimit(request)) {
-                request.log.warn({ reason: 'rate_limited' }, 'github webhook rate limited (internal)');
-                return reply.code(429).send(rateLimitErrorResponse());
-              }
-            },
+            async (request, reply) => {},
           ]
         : undefined,
killedBy: orchestrator webhook exceeding rate limit returns 429
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 429
Received: 200

[Killed] LogicalOperator
src/server.ts:208:19
       preHandler: useInternalLimiter
         ? [
             async (request, reply) => {
-              if (enforceRateLimit && !enforceRateLimit(request)) {
+              if (enforceRateLimit || !enforceRateLimit(request)) {
                 request.log.warn({ reason: 'rate_limited' }, 'github webhook rate limited (internal)');
                 return reply.code(429).send(rateLimitErrorResponse());
killedBy: orchestrator webhook valid signature is accepted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 429

[Killed] BlockStatement
src/server.ts:208:67
       preHandler: useInternalLimiter
         ? [
             async (request, reply) => {
-              if (enforceRateLimit && !enforceRateLimit(request)) {
-                request.log.warn({ reason: 'rate_limited' }, 'github webhook rate limited (internal)');
-                return reply.code(429).send(rateLimitErrorResponse());
-              }
+              if (enforceRateLimit && !enforceRateLimit(request)) {}
             },
           ]
killedBy: orchestrator webhook exceeding rate limit returns 429
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 429
Received: 200

[Killed] BlockStatement
src/server.ts:225:21
 
       const isValid = verifySignature(signature, rawPayload, config.githubWebhookSecret);
 
-      if (!isValid) {
-        request.log.warn({ reason: 'invalid_signature' }, 'github webhook rejected');
-        return reply.code(401).send({ status: 'invalid signature' });
-      }
+      if (!isValid) {}
 
       if (!eventValue || typeof eventValue !== 'string') {
killedBy: orchestrator webhook missing signature header is rejected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Killed] ConditionalExpression
src/server.ts:230:11
         return reply.code(401).send({ status: 'invalid signature' });
       }
 
-      if (!eventValue || typeof eventValue !== 'string') {
+      if (false) {
         request.log.warn({ reason: 'missing_event_header' }, 'github webhook missing event header');
         return reply.code(400).send({ status: 'missing event header' });
killedBy: server branches and handler edges returns 400 when event header missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BlockStatement
src/server.ts:230:58
         return reply.code(401).send({ status: 'invalid signature' });
       }
 
-      if (!eventValue || typeof eventValue !== 'string') {
-        request.log.warn({ reason: 'missing_event_header' }, 'github webhook missing event header');
-        return reply.code(400).send({ status: 'missing event header' });
-      }
+      if (!eventValue || typeof eventValue !== 'string') {}
 
       const event = eventValue.trim();
killedBy: orchestrator webhook missing event header returns 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Survived] ObjectLiteral
src/server.ts:231:26
       }
 
       if (!eventValue || typeof eventValue !== 'string') {
-        request.log.warn({ reason: 'missing_event_header' }, 'github webhook missing event header');
+        request.log.warn({}, 'github webhook missing event header');
         return reply.code(400).send({ status: 'missing event header' });
       }

[Killed] ObjectLiteral
src/server.ts:232:37
 
       if (!eventValue || typeof eventValue !== 'string') {
         request.log.warn({ reason: 'missing_event_header' }, 'github webhook missing event header');
-        return reply.code(400).send({ status: 'missing event header' });
+        return reply.code(400).send({});
       }
 
killedBy: orchestrator webhook missing event header returns 400
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "status": "missing event header",
- }

[Killed] MethodExpression
src/server.ts:235:21
         return reply.code(400).send({ status: 'missing event header' });
       }
 
-      const event = eventValue.trim();
+      const event = eventValue;
       if (!event) {
         request.log.warn({ reason: 'empty_event_header' }, 'github webhook empty event header');
killedBy: orchestrator webhook empty event header returns 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BlockStatement
src/server.ts:236:19
       }
 
       const event = eventValue.trim();
-      if (!event) {
-        request.log.warn({ reason: 'empty_event_header' }, 'github webhook empty event header');
-        return reply.code(400).send({ status: 'missing event header' });
-      }
+      if (!event) {}
 
       const contentType = firstHeaderValue(request.headers['content-type']);
killedBy: orchestrator webhook empty event header returns 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ConditionalExpression
src/server.ts:236:11
       }
 
       const event = eventValue.trim();
-      if (!event) {
+      if (false) {
         request.log.warn({ reason: 'empty_event_header' }, 'github webhook empty event header');
         return reply.code(400).send({ status: 'missing event header' });
killedBy: server branches and handler edges returns 400 when event header is empty string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ObjectLiteral
src/server.ts:238:37
       const event = eventValue.trim();
       if (!event) {
         request.log.warn({ reason: 'empty_event_header' }, 'github webhook empty event header');
-        return reply.code(400).send({ status: 'missing event header' });
+        return reply.code(400).send({});
       }
 
killedBy: orchestrator webhook empty event header returns 400
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "status": "missing event header",
- }

[Killed] EqualityOperator
src/server.ts:242:27
       }
 
       const contentType = firstHeaderValue(request.headers['content-type']);
-      const expectsJson = typeof contentType === 'string' && contentType.includes('application/json');
+      const expectsJson = typeof contentType !== 'string' && contentType.includes('application/json');
 
       let parsedBody: unknown;
killedBy: orchestrator webhook structured log only includes summary fields
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "deliveryId": "delivery-log",
    "event": "issues",

[Timeout] ConditionalExpression
src/server.ts:242:27
       }
 
       const contentType = firstHeaderValue(request.headers['content-type']);
-      const expectsJson = typeof contentType === 'string' && contentType.includes('application/json');
+      const expectsJson = false;
 
       let parsedBody: unknown;

[Killed] LogicalOperator
src/server.ts:245:11
       const expectsJson = typeof contentType === 'string' && contentType.includes('application/json');
 
       let parsedBody: unknown;
-      if (rawPayload && expectsJson) {
+      if (rawPayload || expectsJson) {
         try {
           parsedBody = JSON.parse(rawPayload);
killedBy: orchestrator webhook empty payload passes signature validation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
src/server.ts:245:11
       const expectsJson = typeof contentType === 'string' && contentType.includes('application/json');
 
       let parsedBody: unknown;
-      if (rawPayload && expectsJson) {
+      if (true) {
         try {
           parsedBody = JSON.parse(rawPayload);
killedBy: orchestrator webhook empty payload passes signature validation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
src/server.ts:246:13
 
       let parsedBody: unknown;
       if (rawPayload && expectsJson) {
-        try {
-          parsedBody = JSON.parse(rawPayload);
-        } catch (_error) {
+        try {} catch (_error) {
           request.log.warn({ reason: 'invalid_json' }, 'github webhook payload parse failed');
           return reply.code(400).send({ status: 'invalid payload' });
killedBy: orchestrator webhook structured log only includes summary fields
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "deliveryId": "delivery-log",
    "event": "issues",

[Killed] BlockStatement
src/server.ts:248:26
       if (rawPayload && expectsJson) {
         try {
           parsedBody = JSON.parse(rawPayload);
-        } catch (_error) {
-          request.log.warn({ reason: 'invalid_json' }, 'github webhook payload parse failed');
-          return reply.code(400).send({ status: 'invalid payload' });
-        }
+        } catch (_error) {}
       } else if (rawPayload) {
         parsedBody = undefined;
killedBy: orchestrator webhook invalid JSON body returns a 400 error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Survived] StringLiteral
src/server.ts:249:38
         try {
           parsedBody = JSON.parse(rawPayload);
         } catch (_error) {
-          request.log.warn({ reason: 'invalid_json' }, 'github webhook payload parse failed');
+          request.log.warn({ reason: "" }, 'github webhook payload parse failed');
           return reply.code(400).send({ status: 'invalid payload' });
         }

[Survived] ConditionalExpression
src/server.ts:252:18
           request.log.warn({ reason: 'invalid_json' }, 'github webhook payload parse failed');
           return reply.code(400).send({ status: 'invalid payload' });
         }
-      } else if (rawPayload) {
+      } else if (false) {
         parsedBody = undefined;
       }

[Survived] ConditionalExpression
src/server.ts:252:18
           request.log.warn({ reason: 'invalid_json' }, 'github webhook payload parse failed');
           return reply.code(400).send({ status: 'invalid payload' });
         }
-      } else if (rawPayload) {
+      } else if (true) {
         parsedBody = undefined;
       }

[Killed] LogicalOperator
src/server.ts:256:53
         parsedBody = undefined;
       }
 
-      const summary = buildWebhookLogPayload(event, deliveryId ?? 'unknown', parsedBody);
+      const summary = buildWebhookLogPayload(event, deliveryId && 'unknown', parsedBody);
 
       request.log.info({ webhook: summary }, 'github webhook accepted');
killedBy: orchestrator webhook structured log only includes summary fields
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "deliveryId": "delivery-log",
+   "deliveryId": "unknown",

[Survived] StringLiteral
src/server.ts:256:67
         parsedBody = undefined;
       }
 
-      const summary = buildWebhookLogPayload(event, deliveryId ?? 'unknown', parsedBody);
+      const summary = buildWebhookLogPayload(event, deliveryId ?? "", parsedBody);
 
       request.log.info({ webhook: summary }, 'github webhook accepted');

[Killed] ObjectLiteral
src/server.ts:258:24
 
       const summary = buildWebhookLogPayload(event, deliveryId ?? 'unknown', parsedBody);
 
-      request.log.info({ webhook: summary }, 'github webhook accepted');
+      request.log.info({}, 'github webhook accepted');
 
       // Dispatch to router (best-effort)
killedBy: orchestrator webhook structured log only includes summary fields
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/server.ts:261:11
       request.log.info({ webhook: summary }, 'github webhook accepted');
 
       // Dispatch to router (best-effort)
-      try {
-        if (parsedBody) {
-          routeGithubEvent(event, parsedBody);
-        }
-      } catch (err) {
+      try {} catch (err) {
         request.log.warn({ err }, 'webhook handler error');
       }
killedBy: webhooks + state accepts issues opened and creates CREATED state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
src/server.ts:262:25
 
       // Dispatch to router (best-effort)
       try {
-        if (parsedBody) {
-          routeGithubEvent(event, parsedBody);
-        }
+        if (parsedBody) {}
       } catch (err) {
         request.log.warn({ err }, 'webhook handler error');
killedBy: coverage extras for store/router/handlers issue_comment with agent-like body moves to IN_PROGRESS
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/server.ts:262:13
 
       // Dispatch to router (best-effort)
       try {
-        if (parsedBody) {
+        if (false) {
           routeGithubEvent(event, parsedBody);
         }
killedBy: webhooks + state accepts issues opened and creates CREATED state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[NoCoverage] BlockStatement
src/server.ts:265:21
         if (parsedBody) {
           routeGithubEvent(event, parsedBody);
         }
-      } catch (err) {
-        request.log.warn({ err }, 'webhook handler error');
-      }
+      } catch (err) {}
 
   return reply.code(200).send({ status: 'received' });

[NoCoverage] StringLiteral
src/server.ts:266:35
           routeGithubEvent(event, parsedBody);
         }
       } catch (err) {
-        request.log.warn({ err }, 'webhook handler error');
+        request.log.warn({ err }, "");
       }
 

[Killed] BlockStatement
src/server.ts:275:61
 
   registerTasksRoute(app);
 
-  app.get('/tasks/:issue_number', async (request, reply) => {
-    const param = (request.params as { issue_number?: string }).issue_number;
-    const issue_number = param ? Number(param) : NaN;
-    if (!Number.isFinite(issue_number)) {
-      return reply.code(400).send({ status: 'error', message: 'invalid issue number' });
-    }
-    const rec = getTask(issue_number);
-    if (!rec) {
-      return reply.code(404).send({ status: 'not_found' });
-    }
-    return reply.send({
-      issue_number: rec.issue_number,
-      state: rec.state,
-      last_event: rec.timeline.at(-1),
-      timeline: rec.timeline.slice(-25),
-      repo: rec.repo,
-      pr_number: rec.pr_number,
-      checks: { required: rec.checks.required, green: rec.checks.green },
-      updatedAt: rec.updatedAt,
-    });
-  });
+  app.get('/tasks/:issue_number', async (request, reply) => {});
 
   return app;
killedBy: coverage extras for store/router/handlers issue_comment with agent-like body moves to IN_PROGRESS
statusReason: SyntaxError: Unexpected end of JSON input

[Killed] BlockStatement
src/server.ts:278:41
   app.get('/tasks/:issue_number', async (request, reply) => {
     const param = (request.params as { issue_number?: string }).issue_number;
     const issue_number = param ? Number(param) : NaN;
-    if (!Number.isFinite(issue_number)) {
-      return reply.code(400).send({ status: 'error', message: 'invalid issue number' });
-    }
+    if (!Number.isFinite(issue_number)) {}
     const rec = getTask(issue_number);
     if (!rec) {
killedBy: server GET /tasks branches returns 400 for invalid issue number and 404 when not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Killed] BooleanLiteral
src/server.ts:278:9
   app.get('/tasks/:issue_number', async (request, reply) => {
     const param = (request.params as { issue_number?: string }).issue_number;
     const issue_number = param ? Number(param) : NaN;
-    if (!Number.isFinite(issue_number)) {
+    if (Number.isFinite(issue_number)) {
       return reply.code(400).send({ status: 'error', message: 'invalid issue number' });
     }
killedBy: webhooks + state accepts issues opened and creates CREATED state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Survived] StringLiteral
src/server.ts:279:45
     const param = (request.params as { issue_number?: string }).issue_number;
     const issue_number = param ? Number(param) : NaN;
     if (!Number.isFinite(issue_number)) {
-      return reply.code(400).send({ status: 'error', message: 'invalid issue number' });
+      return reply.code(400).send({ status: "", message: 'invalid issue number' });
     }
     const rec = getTask(issue_number);

[Killed] ConditionalExpression
src/server.ts:282:9
       return reply.code(400).send({ status: 'error', message: 'invalid issue number' });
     }
     const rec = getTask(issue_number);
-    if (!rec) {
+    if (false) {
       return reply.code(404).send({ status: 'not_found' });
     }
killedBy: server GET /tasks branches returns 400 for invalid issue number and 404 when not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] BooleanLiteral
src/server.ts:282:9
       return reply.code(400).send({ status: 'error', message: 'invalid issue number' });
     }
     const rec = getTask(issue_number);
-    if (!rec) {
+    if (rec) {
       return reply.code(404).send({ status: 'not_found' });
     }
killedBy: webhooks + state accepts issues opened and creates CREATED state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Survived] UnaryOperator
src/server.ts:288:35
     return reply.send({
       issue_number: rec.issue_number,
       state: rec.state,
-      last_event: rec.timeline.at(-1),
+      last_event: rec.timeline.at(+1),
       timeline: rec.timeline.slice(-25),
       repo: rec.repo,

[Survived] MethodExpression
src/server.ts:289:17
       issue_number: rec.issue_number,
       state: rec.state,
       last_event: rec.timeline.at(-1),
-      timeline: rec.timeline.slice(-25),
+      timeline: rec.timeline,
       repo: rec.repo,
       pr_number: rec.pr_number,

[Survived] UnaryOperator
src/server.ts:289:36
       issue_number: rec.issue_number,
       state: rec.state,
       last_event: rec.timeline.at(-1),
-      timeline: rec.timeline.slice(-25),
+      timeline: rec.timeline.slice(+25),
       repo: rec.repo,
       pr_number: rec.pr_number,

[Killed] LogicalOperator
src/server.ts:301:23
 }
 
 export function loadConfigFromEnv(env = process.env): AppConfig {
-  const port = Number(env.PORT ?? '8080');
+  const port = Number(env.PORT && '8080');
   const githubWebhookSecret = env.GITHUB_WEBHOOK_SECRET;
   const githubAppId = env.GITHUB_APP_ID;
killedBy: loadConfigFromEnv builds config with defaults
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "githubAppId": "42",
    "githubAppPrivateKey": "base64-key",

[Killed] StringLiteral
src/server.ts:301:35
 }
 
 export function loadConfigFromEnv(env = process.env): AppConfig {
-  const port = Number(env.PORT ?? '8080');
+  const port = Number(env.PORT ?? "");
   const githubWebhookSecret = env.GITHUB_WEBHOOK_SECRET;
   const githubAppId = env.GITHUB_APP_ID;
killedBy: startRuntime startRuntime falls back to defaults when optional parameters omitted
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "host": "0.0.0.0",
-   "port": 8080,

[Killed] ConditionalExpression
src/server.ts:306:7
   const githubAppId = env.GITHUB_APP_ID;
   const githubPrivateKey = env.GITHUB_APP_PRIVATE_KEY;
 
-  if (!githubWebhookSecret) {
+  if (false) {
     throw new Error('GITHUB_WEBHOOK_SECRET is required');
   }
killedBy: loadConfigFromEnv throws when webhook secret missing
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "GITHUB_WEBHOOK_SECRET is required"
Received message:   "GITHUB_APP_ID is required"

      547 |       } else {
      548 |         stryCov_9fa48("495");
    > 549 |         throw new Error(stryMutAct_9fa48("496") ? "" : (stryCov_9fa48("496"), 'GITHUB_APP_ID is required'));

[Killed] BlockStatement
src/server.ts:306:29
   const githubAppId = env.GITHUB_APP_ID;
   const githubPrivateKey = env.GITHUB_APP_PRIVATE_KEY;
 
-  if (!githubWebhookSecret) {
-    throw new Error('GITHUB_WEBHOOK_SECRET is required');
-  }
+  if (!githubWebhookSecret) {}
 
   if (!githubAppId) {
killedBy: loadConfigFromEnv throws when webhook secret missing
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "GITHUB_WEBHOOK_SECRET is required"
Received message:   "GITHUB_APP_ID is required"

      547 |       } else {
      548 |         stryCov_9fa48("495");
    > 549 |         throw new Error(stryMutAct_9fa48("496") ? "" : (stryCov_9fa48("496"), 'GITHUB_APP_ID is required'));

[Killed] BlockStatement
src/server.ts:310:21
     throw new Error('GITHUB_WEBHOOK_SECRET is required');
   }
 
-  if (!githubAppId) {
-    throw new Error('GITHUB_APP_ID is required');
-  }
+  if (!githubAppId) {}
 
   if (!githubPrivateKey) {
killedBy: loadConfigFromEnv throws when app id missing
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "GITHUB_APP_ID is required"
Received message:   "GITHUB_APP_PRIVATE_KEY is required"

      555 |       } else {
      556 |         stryCov_9fa48("500");
    > 557 |         throw new Error(stryMutAct_9fa48("501") ? "" : (stryCov_9fa48("501"), 'GITHUB_APP_PRIVATE_KEY is required'));

[Killed] ConditionalExpression
src/server.ts:310:7
     throw new Error('GITHUB_WEBHOOK_SECRET is required');
   }
 
-  if (!githubAppId) {
+  if (false) {
     throw new Error('GITHUB_APP_ID is required');
   }
killedBy: loadConfigFromEnv throws when app id missing
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "GITHUB_APP_ID is required"
Received message:   "GITHUB_APP_PRIVATE_KEY is required"

      555 |       } else {
      556 |         stryCov_9fa48("500");
    > 557 |         throw new Error(stryMutAct_9fa48("501") ? "" : (stryCov_9fa48("501"), 'GITHUB_APP_PRIVATE_KEY is required'));

[Killed] BlockStatement
src/server.ts:314:26
     throw new Error('GITHUB_APP_ID is required');
   }
 
-  if (!githubPrivateKey) {
-    throw new Error('GITHUB_APP_PRIVATE_KEY is required');
-  }
+  if (!githubPrivateKey) {}
 
   return {
killedBy: loadConfigFromEnv throws when private key missing
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "GITHUB_APP_PRIVATE_KEY is required"

Received function did not throw

[Killed] ConditionalExpression
src/server.ts:314:7
     throw new Error('GITHUB_APP_ID is required');
   }
 
-  if (!githubPrivateKey) {
+  if (false) {
     throw new Error('GITHUB_APP_PRIVATE_KEY is required');
   }
killedBy: loadConfigFromEnv throws when private key missing
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "GITHUB_APP_PRIVATE_KEY is required"

Received function did not throw

[Killed] BlockStatement
src/server.ts:331:18
   exitFn: (code?: number) => never | void = process.exit,
   errorLogger: (message?: unknown, ...optionalParams: unknown[]) => void = console.error,
   serverFactory: (config: AppConfig) => FastifyInstance = buildServer,
-): Promise<void> {
-  try {
-    const config = loadConfigFromEnv(env);
-    const app = serverFactory(config);
-    await app.listen({ port: config.port, host: '0.0.0.0' });
-  } catch (error) {
-    const message = error instanceof Error ? error.message : 'unknown error';
-    errorLogger('Failed to start orchestrator service:', message);
-    exitFn(1);
-  }
-}
+): Promise<void> {}
 
 /* c8 ignore start */
killedBy: startRuntime logs and exits when configuration fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/server.ts:332:7
   errorLogger: (message?: unknown, ...optionalParams: unknown[]) => void = console.error,
   serverFactory: (config: AppConfig) => FastifyInstance = buildServer,
 ): Promise<void> {
-  try {
-    const config = loadConfigFromEnv(env);
-    const app = serverFactory(config);
-    await app.listen({ port: config.port, host: '0.0.0.0' });
-  } catch (error) {
+  try {} catch (error) {
     const message = error instanceof Error ? error.message : 'unknown error';
     errorLogger('Failed to start orchestrator service:', message);
killedBy: startRuntime logs and exits when configuration fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ObjectLiteral
src/server.ts:335:22
   try {
     const config = loadConfigFromEnv(env);
     const app = serverFactory(config);
-    await app.listen({ port: config.port, host: '0.0.0.0' });
+    await app.listen({});
   } catch (error) {
     const message = error instanceof Error ? error.message : 'unknown error';
killedBy: startRuntime listens on the configured port when configuration succeeds
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "host": "0.0.0.0",
-   "port": 3333,

[Killed] BlockStatement
src/server.ts:336:19
     const config = loadConfigFromEnv(env);
     const app = serverFactory(config);
     await app.listen({ port: config.port, host: '0.0.0.0' });
-  } catch (error) {
-    const message = error instanceof Error ? error.message : 'unknown error';
-    errorLogger('Failed to start orchestrator service:', message);
-    exitFn(1);
-  }
+  } catch (error) {}
 }
 
killedBy: startRuntime logs and exits when configuration fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/server.ts:344:24
 }
 
 /* c8 ignore start */
-async function start() {
-  /* c8 ignore next */
-  if (require.main !== module) {
-    return;
-  }
-
-  /* c8 ignore next */
-  await startRuntime();
-}
+async function start() {}
 
 void start();
killedBy: startRuntime bootstrap exits with non-zero status when env is incomplete
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/server.ts:346:7
 /* c8 ignore start */
 async function start() {
   /* c8 ignore next */
-  if (require.main !== module) {
+  if (true) {
     return;
   }
killedBy: startRuntime bootstrap exits with non-zero status when env is incomplete
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0
