[Timeout] BlockStatement
src/github/createIssue.ts:28:63
   issueUrl: string;
 }
 
-function uniqueLabels(labels: string[] | undefined): string[] {
-  const merged = new Set(labels ?? []);
-  merged.add('ai-task');
-  return Array.from(merged);
-}
+function uniqueLabels(labels: string[] | undefined): string[] {}
 
 function renderList(title: string, items: ConstraintList): string[] {

[Killed] LogicalOperator
src/github/createIssue.ts:29:26
 }
 
 function uniqueLabels(labels: string[] | undefined): string[] {
-  const merged = new Set(labels ?? []);
+  const merged = new Set(labels && []);
   merged.add('ai-task');
   return Array.from(merged);
killedBy: POST /tasks adds ai-task label when not provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   "custom",
    "ai-task",

[Killed] BlockStatement
src/github/createIssue.ts:34:69
   return Array.from(merged);
 }
 
-function renderList(title: string, items: ConstraintList): string[] {
-  const lines: string[] = [`${title}:`];
-  if (!items || items.length === 0) {
-    lines.push('  -');
-    return lines;
-  }
-  for (const item of items) {
-    lines.push(`  - ${item}`);
-  }
-  return lines;
-}
+function renderList(title: string, items: ConstraintList): string[] {}
 
 function renderConstraints(constraints: TaskConstraints | undefined): string {
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] StringLiteral
src/github/createIssue.ts:35:28
 }
 
 function renderList(title: string, items: ConstraintList): string[] {
-  const lines: string[] = [`${title}:`];
+  const lines: string[] = [``];
   if (!items || items.length === 0) {
     lines.push('  -');
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "ALLOWED_PATHS"
Received string:    "## Objective
Add /version endpoint and expose in UI·
## Constraints
```yaml·
  - services/api/**·

[Killed] ConditionalExpression
src/github/createIssue.ts:36:7
 
 function renderList(title: string, items: ConstraintList): string[] {
   const lines: string[] = [`${title}:`];
-  if (!items || items.length === 0) {
+  if (false) {
     lines.push('  -');
     return lines;
killedBy: createIssue helpers via createAgentIssue prefers html_url when present
statusReason: TypeError: items is not iterable

[Killed] ConditionalExpression
src/github/createIssue.ts:36:7
 
 function renderList(title: string, items: ConstraintList): string[] {
   const lines: string[] = [`${title}:`];
-  if (!items || items.length === 0) {
+  if (true) {
     lines.push('  -');
     return lines;
killedBy: createIssue helpers via createAgentIssue renders provided constraints and checklists into body
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "  - src/"
Received string:    "## Objective
o·
## Constraints
```yaml
ALLOWED_PATHS:

[Killed] BlockStatement
src/github/createIssue.ts:40:29
     lines.push('  -');
     return lines;
   }
-  for (const item of items) {
-    lines.push(`  - ${item}`);
-  }
+  for (const item of items) {}
   return lines;
 }
killedBy: createIssue helpers via createAgentIssue renders provided constraints and checklists into body
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "  - src/"
Received string:    "## Objective
o·
## Constraints
```yaml
ALLOWED_PATHS:

[Killed] BlockStatement
src/github/createIssue.ts:46:78
   return lines;
 }
 
-function renderConstraints(constraints: TaskConstraints | undefined): string {
-  const allowed = renderList('ALLOWED_PATHS', constraints?.allowedPaths);
-  const forbidden = renderList('FORBIDDEN_PATHS', constraints?.forbiddenPaths);
-  const timeCap = `TIME_CAP_MIN: ${constraints?.timeCapMin ?? 0}`;
-  const costCap = `COST_CAP_USD: ${constraints?.costCapUSD ?? 0}`;
-
-  return ['```yaml', ...allowed, ...forbidden, timeCap, costCap, '```'].join('\n');
-}
+function renderConstraints(constraints: TaskConstraints | undefined): string {}
 
 function renderChecklist(items: string[] | undefined): string {
killedBy: createIssue helpers via createAgentIssue ensures ai-task label uniqueness and renders empty constraints as placeholder
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "ALLOWED_PATHS:"
Received string:    "## Objective
o·
## Constraints··
## Test expectations
- (not specified)·

[Killed] OptionalChaining
src/github/createIssue.ts:47:47
 }
 
 function renderConstraints(constraints: TaskConstraints | undefined): string {
-  const allowed = renderList('ALLOWED_PATHS', constraints?.allowedPaths);
+  const allowed = renderList('ALLOWED_PATHS', constraints.allowedPaths);
   const forbidden = renderList('FORBIDDEN_PATHS', constraints?.forbiddenPaths);
   const timeCap = `TIME_CAP_MIN: ${constraints?.timeCapMin ?? 0}`;
killedBy: POST /tasks adds ai-task label when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] StringLiteral
src/github/createIssue.ts:47:30
 }
 
 function renderConstraints(constraints: TaskConstraints | undefined): string {
-  const allowed = renderList('ALLOWED_PATHS', constraints?.allowedPaths);
+  const allowed = renderList("", constraints?.allowedPaths);
   const forbidden = renderList('FORBIDDEN_PATHS', constraints?.forbiddenPaths);
   const timeCap = `TIME_CAP_MIN: ${constraints?.timeCapMin ?? 0}`;
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "ALLOWED_PATHS"
Received string:    "## Objective
Add /version endpoint and expose in UI·
## Constraints
```yaml
:

[Killed] OptionalChaining
src/github/createIssue.ts:48:51
 
 function renderConstraints(constraints: TaskConstraints | undefined): string {
   const allowed = renderList('ALLOWED_PATHS', constraints?.allowedPaths);
-  const forbidden = renderList('FORBIDDEN_PATHS', constraints?.forbiddenPaths);
+  const forbidden = renderList('FORBIDDEN_PATHS', constraints.forbiddenPaths);
   const timeCap = `TIME_CAP_MIN: ${constraints?.timeCapMin ?? 0}`;
   const costCap = `COST_CAP_USD: ${constraints?.costCapUSD ?? 0}`;
killedBy: POST /tasks adds ai-task label when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] StringLiteral
src/github/createIssue.ts:48:32
 
 function renderConstraints(constraints: TaskConstraints | undefined): string {
   const allowed = renderList('ALLOWED_PATHS', constraints?.allowedPaths);
-  const forbidden = renderList('FORBIDDEN_PATHS', constraints?.forbiddenPaths);
+  const forbidden = renderList("", constraints?.forbiddenPaths);
   const timeCap = `TIME_CAP_MIN: ${constraints?.timeCapMin ?? 0}`;
   const costCap = `COST_CAP_USD: ${constraints?.costCapUSD ?? 0}`;
killedBy: createIssue helpers via createAgentIssue ensures ai-task label uniqueness and renders empty constraints as placeholder
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "FORBIDDEN_PATHS:"
Received string:    "## Objective
o·
## Constraints
```yaml
ALLOWED_PATHS:

[Killed] LogicalOperator
src/github/createIssue.ts:49:36
 function renderConstraints(constraints: TaskConstraints | undefined): string {
   const allowed = renderList('ALLOWED_PATHS', constraints?.allowedPaths);
   const forbidden = renderList('FORBIDDEN_PATHS', constraints?.forbiddenPaths);
-  const timeCap = `TIME_CAP_MIN: ${constraints?.timeCapMin ?? 0}`;
+  const timeCap = `TIME_CAP_MIN: ${constraints?.timeCapMin && 0}`;
   const costCap = `COST_CAP_USD: ${constraints?.costCapUSD ?? 0}`;
 
killedBy: createIssue helpers via createAgentIssue renders provided constraints and checklists into body
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "TIME_CAP_MIN: 30"
Received string:    "## Objective
o·
## Constraints
```yaml
ALLOWED_PATHS:

[Killed] OptionalChaining
src/github/createIssue.ts:49:36
 function renderConstraints(constraints: TaskConstraints | undefined): string {
   const allowed = renderList('ALLOWED_PATHS', constraints?.allowedPaths);
   const forbidden = renderList('FORBIDDEN_PATHS', constraints?.forbiddenPaths);
-  const timeCap = `TIME_CAP_MIN: ${constraints?.timeCapMin ?? 0}`;
+  const timeCap = `TIME_CAP_MIN: ${constraints.timeCapMin ?? 0}`;
   const costCap = `COST_CAP_USD: ${constraints?.costCapUSD ?? 0}`;
 
killedBy: createIssue helpers via createAgentIssue prefers html_url when present
statusReason: TypeError: Cannot read properties of undefined (reading 'timeCapMin')

[Killed] LogicalOperator
src/github/createIssue.ts:50:36
   const allowed = renderList('ALLOWED_PATHS', constraints?.allowedPaths);
   const forbidden = renderList('FORBIDDEN_PATHS', constraints?.forbiddenPaths);
   const timeCap = `TIME_CAP_MIN: ${constraints?.timeCapMin ?? 0}`;
-  const costCap = `COST_CAP_USD: ${constraints?.costCapUSD ?? 0}`;
+  const costCap = `COST_CAP_USD: ${constraints?.costCapUSD && 0}`;
 
   return ['```yaml', ...allowed, ...forbidden, timeCap, costCap, '```'].join('\n');
killedBy: createIssue helpers via createAgentIssue renders provided constraints and checklists into body
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "COST_CAP_USD: 5"
Received string:    "## Objective
o·
## Constraints
```yaml
ALLOWED_PATHS:

[Killed] OptionalChaining
src/github/createIssue.ts:50:36
   const allowed = renderList('ALLOWED_PATHS', constraints?.allowedPaths);
   const forbidden = renderList('FORBIDDEN_PATHS', constraints?.forbiddenPaths);
   const timeCap = `TIME_CAP_MIN: ${constraints?.timeCapMin ?? 0}`;
-  const costCap = `COST_CAP_USD: ${constraints?.costCapUSD ?? 0}`;
+  const costCap = `COST_CAP_USD: ${constraints.costCapUSD ?? 0}`;
 
   return ['```yaml', ...allowed, ...forbidden, timeCap, costCap, '```'].join('\n');
killedBy: POST /tasks adds ai-task label when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] ArrayDeclaration
src/github/createIssue.ts:52:10
   const timeCap = `TIME_CAP_MIN: ${constraints?.timeCapMin ?? 0}`;
   const costCap = `COST_CAP_USD: ${constraints?.costCapUSD ?? 0}`;
 
-  return ['```yaml', ...allowed, ...forbidden, timeCap, costCap, '```'].join('\n');
+  return [].join('\n');
 }
 
killedBy: createIssue helpers via createAgentIssue ensures ai-task label uniqueness and renders empty constraints as placeholder
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "ALLOWED_PATHS:"
Received string:    "## Objective
o·
## Constraints··
## Test expectations
- (not specified)·

[Killed] BlockStatement
src/github/createIssue.ts:55:63
   return ['```yaml', ...allowed, ...forbidden, timeCap, costCap, '```'].join('\n');
 }
 
-function renderChecklist(items: string[] | undefined): string {
-  if (!items || items.length === 0) {
-    return '- (not specified)';
-  }
-  return items.map((item) => `- ${item}`).join('\n');
-}
+function renderChecklist(items: string[] | undefined): string {}
 
 function buildIssueBody(input: AgentIssueInput): string {
killedBy: createIssue helpers via createAgentIssue renders provided constraints and checklists into body
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "- unit passes"
Received string:    "## Objective
o·
## Constraints
```yaml
ALLOWED_PATHS:

[Killed] LogicalOperator
src/github/createIssue.ts:56:7
 }
 
 function renderChecklist(items: string[] | undefined): string {
-  if (!items || items.length === 0) {
+  if (!items && items.length === 0) {
     return '- (not specified)';
   }
killedBy: createIssue helpers via createAgentIssue prefers html_url when present
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/github/createIssue.ts:56:7
 }
 
 function renderChecklist(items: string[] | undefined): string {
-  if (!items || items.length === 0) {
+  if (true) {
     return '- (not specified)';
   }
killedBy: createIssue helpers via createAgentIssue renders provided constraints and checklists into body
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "- unit passes"
Received string:    "## Objective
o·
## Constraints
```yaml
ALLOWED_PATHS:

[Survived] StringLiteral
src/github/createIssue.ts:57:12
 
 function renderChecklist(items: string[] | undefined): string {
   if (!items || items.length === 0) {
-    return '- (not specified)';
+    return "";
   }
   return items.map((item) => `- ${item}`).join('\n');

[Killed] ArrowFunction
src/github/createIssue.ts:59:20
   if (!items || items.length === 0) {
     return '- (not specified)';
   }
-  return items.map((item) => `- ${item}`).join('\n');
+  return items.map(() => undefined).join('\n');
 }
 
killedBy: createIssue helpers via createAgentIssue renders provided constraints and checklists into body
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "- unit passes"
Received string:    "## Objective
o·
## Constraints
```yaml
ALLOWED_PATHS:

[Survived] StringLiteral
src/github/createIssue.ts:59:48
   if (!items || items.length === 0) {
     return '- (not specified)';
   }
-  return items.map((item) => `- ${item}`).join('\n');
+  return items.map((item) => `- ${item}`).join("");
 }
 

[Killed] BlockStatement
src/github/createIssue.ts:62:57
   return items.map((item) => `- ${item}`).join('\n');
 }
 
-function buildIssueBody(input: AgentIssueInput): string {
-  return [
-    '## Objective',
-    input.objective,
-    '',
-    '## Constraints',
-    renderConstraints(input.constraints),
-    '',
-    '## Test expectations',
-    renderChecklist(input.testSpec),
-    '',
-    '## Acceptance criteria',
-    renderChecklist(input.acceptance),
-    '',
-    '## Notes',
-    '- Assign to **Copilot – Coding Agent** via GitHub UI if not auto-assigned by label.',
-    '- This issue was created by the Orchestrator.',
-  ].join('\n');
-}
+function buildIssueBody(input: AgentIssueInput): string {}
 
 export async function createAgentIssue(input: AgentIssueInput): Promise<AgentIssueResult> {
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ArrayDeclaration
src/github/createIssue.ts:63:10
 }
 
 function buildIssueBody(input: AgentIssueInput): string {
-  return [
-    '## Objective',
-    input.objective,
-    '',
-    '## Constraints',
-    renderConstraints(input.constraints),
-    '',
-    '## Test expectations',
-    renderChecklist(input.testSpec),
-    '',
-    '## Acceptance criteria',
-    renderChecklist(input.acceptance),
-    '',
-    '## Notes',
-    '- Assign to **Copilot – Coding Agent** via GitHub UI if not auto-assigned by label.',
-    '- This issue was created by the Orchestrator.',
-  ].join('\n');
+  return [].join('\n');
 }
 
killedBy: createIssue helpers via createAgentIssue ensures ai-task label uniqueness and renders empty constraints as placeholder
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "ALLOWED_PATHS:"
Received string:    ""

[Killed] StringLiteral
src/github/createIssue.ts:64:5
 
 function buildIssueBody(input: AgentIssueInput): string {
   return [
-    '## Objective',
+    "",
     input.objective,
     '',
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "## Objective"
Received string:    "
Add /version endpoint and expose in UI·
## Constraints
```yaml
ALLOWED_PATHS:

[Survived] StringLiteral
src/github/createIssue.ts:66:5
   return [
     '## Objective',
     input.objective,
-    '',
+    "Stryker was here!",
     '## Constraints',
     renderConstraints(input.constraints),

[Killed] StringLiteral
src/github/createIssue.ts:73:5
     '## Test expectations',
     renderChecklist(input.testSpec),
     '',
-    '## Acceptance criteria',
+    "",
     renderChecklist(input.acceptance),
     '',
killedBy: createIssue helpers via createAgentIssue renders provided constraints and checklists into body
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Acceptance criteria"
Received string:    "## Objective
o·
## Constraints
```yaml
ALLOWED_PATHS:

[Survived] StringLiteral
src/github/createIssue.ts:76:5
     '## Acceptance criteria',
     renderChecklist(input.acceptance),
     '',
-    '## Notes',
+    "",
     '- Assign to **Copilot – Coding Agent** via GitHub UI if not auto-assigned by label.',
     '- This issue was created by the Orchestrator.',

[Survived] StringLiteral
src/github/createIssue.ts:77:5
     renderChecklist(input.acceptance),
     '',
     '## Notes',
-    '- Assign to **Copilot – Coding Agent** via GitHub UI if not auto-assigned by label.',
+    "",
     '- This issue was created by the Orchestrator.',
   ].join('\n');

[Survived] StringLiteral
src/github/createIssue.ts:78:5
     '',
     '## Notes',
     '- Assign to **Copilot – Coding Agent** via GitHub UI if not auto-assigned by label.',
-    '- This issue was created by the Orchestrator.',
+    "",
   ].join('\n');
 }

[Killed] BlockStatement
src/github/createIssue.ts:82:91
   ].join('\n');
 }
 
-export async function createAgentIssue(input: AgentIssueInput): Promise<AgentIssueResult> {
-  const labels = uniqueLabels(input.labels);
-  const body = buildIssueBody(input);
-
-  const installationToken = await getInstallationTokenForOwner(input.owner);
-
-  const issueResponse = await githubRequest<{ number: number; html_url?: string; url?: string }>({
-    token: `token ${installationToken}`,
-    method: 'POST',
-    url: `/repos/${input.owner}/${input.repo}/issues`,
-    body: {
-      title: `[Agent Task] ${input.title}`,
-      labels,
-      body,
-    },
-  });
-
-  return {
-    issueNumber: issueResponse.number,
-    issueUrl: issueResponse.html_url ?? issueResponse.url ?? `https://github.com/${input.owner}/${input.repo}/issues/${issueResponse.number}`,
-  };
-}
+export async function createAgentIssue(input: AgentIssueInput): Promise<AgentIssueResult> {}
 
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] ObjectLiteral
src/github/createIssue.ts:88:98
 
   const installationToken = await getInstallationTokenForOwner(input.owner);
 
-  const issueResponse = await githubRequest<{ number: number; html_url?: string; url?: string }>({
-    token: `token ${installationToken}`,
-    method: 'POST',
-    url: `/repos/${input.owner}/${input.repo}/issues`,
-    body: {
-      title: `[Agent Task] ${input.title}`,
-      labels,
-      body,
-    },
-  });
+  const issueResponse = await githubRequest<{ number: number; html_url?: string; url?: string }>({});
 
   return {
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] LogicalOperator
src/github/createIssue.ts:101:15
 
   return {
     issueNumber: issueResponse.number,
-    issueUrl: issueResponse.html_url ?? issueResponse.url ?? `https://github.com/${input.owner}/${input.repo}/issues/${issueResponse.number}`,
+    issueUrl: issueResponse.html_url && issueResponse.url ?? `https://github.com/${input.owner}/${input.repo}/issues/${issueResponse.number}`,
   };
 }
killedBy: createIssue helpers via createAgentIssue falls back to url when html_url is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://api.github.com/repos/x/y/issues/8"
Received: "https://github.com/x/y/issues/8"

[Killed] LogicalOperator
src/github/createIssue.ts:101:15
 
   return {
     issueNumber: issueResponse.number,
-    issueUrl: issueResponse.html_url ?? issueResponse.url ?? `https://github.com/${input.owner}/${input.repo}/issues/${issueResponse.number}`,
+    issueUrl: (issueResponse.html_url ?? issueResponse.url) && `https://github.com/${input.owner}/${input.repo}/issues/${issueResponse.number}`,
   };
 }
killedBy: createIssue helpers via createAgentIssue falls back to url when html_url is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://api.github.com/repos/x/y/issues/8"
Received: "https://github.com/x/y/issues/8"
