[Survived] BlockStatement
src/github/appAuth.ts:8:58
 
 const installationCache = new Map<string, number>();
 
-function decodePrivateKey(privateKeyB64: string): string {
-  return Buffer.from(privateKeyB64, 'base64').toString('utf8');
-}
+function decodePrivateKey(privateKeyB64: string): string {}
 
 function getRequiredEnv(name: string): string {

[Killed] BlockStatement
src/github/appAuth.ts:12:47
   return Buffer.from(privateKeyB64, 'base64').toString('utf8');
 }
 
-function getRequiredEnv(name: string): string {
-  const value = process.env[name];
-  if (!value) {
-    throw new Error(`${name} is required`);
-  }
-  return value;
-}
+function getRequiredEnv(name: string): string {}
 
 export function buildAppJwt(appId: string, privateKeyB64: string): string {
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] BlockStatement
src/github/appAuth.ts:14:15
 
 function getRequiredEnv(name: string): string {
   const value = process.env[name];
-  if (!value) {
-    throw new Error(`${name} is required`);
-  }
+  if (!value) {}
   return value;
 }
killedBy: installation helpers throws when required env missing for installation token
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "GITHUB_APP_ID is required"
Received message:   "GitHub request failed (401): Bad credentials"

      133 |         stryCov_9fa48("32");
    > 135 |         throw new Error(stryMutAct_9fa48("42") ? `` : (stryCov_9fa48("42"), `GitHub request failed (${response.status}): ${String(message)}`));

[Killed] ConditionalExpression
src/github/appAuth.ts:14:7
 
 function getRequiredEnv(name: string): string {
   const value = process.env[name];
-  if (!value) {
+  if (true) {
     throw new Error(`${name} is required`);
   }
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] StringLiteral
src/github/appAuth.ts:15:21
 function getRequiredEnv(name: string): string {
   const value = process.env[name];
   if (!value) {
-    throw new Error(`${name} is required`);
+    throw new Error(``);
   }
   return value;
killedBy: installation helpers throws when required env missing for installation token
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "GITHUB_APP_ID is required"
Received message:   ""

      69 |       } else {
      70 |         stryCov_9fa48("9");
    > 71 |         throw new Error(stryMutAct_9fa48("10") ? `` : (stryCov_9fa48("10"), `${name} is required`));

[Killed] BlockStatement
src/github/appAuth.ts:20:75
   return value;
 }
 
-export function buildAppJwt(appId: string, privateKeyB64: string): string {
-  const privateKey = decodePrivateKey(privateKeyB64);
-  const now = Math.floor(Date.now() / 1000);
-
-  return jwt.sign(
-    {
-      iat: now - 60,
-      exp: now + 9 * 60,
-      iss: appId,
-    },
-    privateKey,
-    { algorithm: 'RS256' },
-  );
-}
+export function buildAppJwt(appId: string, privateKeyB64: string): string {}
 
 export interface GitHubRequestOptions {
killedBy: buildAppJwt creates a JWT string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string"
Received: "undefined"

[Survived] ArithmeticOperator
src/github/appAuth.ts:22:26
 
 export function buildAppJwt(appId: string, privateKeyB64: string): string {
   const privateKey = decodePrivateKey(privateKeyB64);
-  const now = Math.floor(Date.now() / 1000);
+  const now = Math.floor(Date.now() * 1000);
 
   return jwt.sign(

[Survived] ArithmeticOperator
src/github/appAuth.ts:26:12
 
   return jwt.sign(
     {
-      iat: now - 60,
+      iat: now + 60,
       exp: now + 9 * 60,
       iss: appId,

[Survived] ArithmeticOperator
src/github/appAuth.ts:27:18
   return jwt.sign(
     {
       iat: now - 60,
-      exp: now + 9 * 60,
+      exp: now + 9 / 60,
       iss: appId,
     },

[Survived] ArithmeticOperator
src/github/appAuth.ts:27:12
   return jwt.sign(
     {
       iat: now - 60,
-      exp: now + 9 * 60,
+      exp: now - 9 * 60,
       iss: appId,
     },

[Survived] StringLiteral
src/github/appAuth.ts:31:18
       iss: appId,
     },
     privateKey,
-    { algorithm: 'RS256' },
+    { algorithm: "" },
   );
 }

[Killed] ObjectLiteral
src/github/appAuth.ts:43:60
 }
 
 export async function githubRequest<T = unknown>({ token, method, url, body }: GitHubRequestOptions): Promise<T> {
-  const response = await fetch(`${GITHUB_API_BASE}${url}`, {
-    method,
-    headers: {
-      Authorization: token,
-      Accept: 'application/vnd.github+json',
-      'User-Agent': USER_AGENT,
-      'Content-Type': 'application/json',
-    },
-    body: body ? JSON.stringify(body) : undefined,
-  });
+  const response = await fetch(`${GITHUB_API_BASE}${url}`, {});
 
   if (response.status === 204) {
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Survived] StringLiteral
src/github/appAuth.ts:47:15
     method,
     headers: {
       Authorization: token,
-      Accept: 'application/vnd.github+json',
+      Accept: "",
       'User-Agent': USER_AGENT,
       'Content-Type': 'application/json',

[Killed] ConditionalExpression
src/github/appAuth.ts:62:21
   const data = text ? (JSON.parse(text) as T) : (undefined as T);
 
   if (!response.ok) {
-    const message = typeof data === 'object' && data && 'message' in (data as Record<string, unknown>)
+    const message = true
       ? (data as Record<string, unknown>).message
       : response.statusText;
killedBy: githubRequest uses status text when error response has no body
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "GitHub request failed (500): Internal Server Error"
Received message:   "Cannot read properties of undefined (reading 'message')"

      132 |       } else {
      133 |         stryCov_9fa48("32");

[Killed] ConditionalExpression
src/github/appAuth.ts:62:21
   const data = text ? (JSON.parse(text) as T) : (undefined as T);
 
   if (!response.ok) {
-    const message = typeof data === 'object' && data && 'message' in (data as Record<string, unknown>)
+    const message = true && 'message' in (data as Record<string, unknown>)
       ? (data as Record<string, unknown>).message
       : response.statusText;
killedBy: githubRequest uses status text when error response has no body
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "GitHub request failed (500): Internal Server Error"
Received message:   "Cannot use 'in' operator to search for 'message' in undefined"

      132 |       } else {
      133 |         stryCov_9fa48("32");

[Killed] StringLiteral
src/github/appAuth.ts:65:21
     const message = typeof data === 'object' && data && 'message' in (data as Record<string, unknown>)
       ? (data as Record<string, unknown>).message
       : response.statusText;
-    throw new Error(`GitHub request failed (${response.status}): ${String(message)}`);
+    throw new Error(``);
   }
 
killedBy: githubRequest throws on GitHub error
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "GitHub request failed (404): Not Found"
Received message:   ""

      133 |         stryCov_9fa48("32");
    > 135 |         throw new Error(stryMutAct_9fa48("42") ? `` : (stryCov_9fa48("42"), `GitHub request failed (${response.status}): ${String(message)}`));

[Killed] BlockStatement
src/github/appAuth.ts:73:24
 
 export async function getInstallationId(owner: string): Promise<number> {
   const envInstallation = process.env.GITHUB_INSTALLATION_ID;
-  if (envInstallation) {
-    return Number(envInstallation);
-  }
+  if (envInstallation) {}
 
   const cacheKey = owner.toLowerCase();
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] ConditionalExpression
src/github/appAuth.ts:73:7
 
 export async function getInstallationId(owner: string): Promise<number> {
   const envInstallation = process.env.GITHUB_INSTALLATION_ID;
-  if (envInstallation) {
+  if (false) {
     return Number(envInstallation);
   }
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] MethodExpression
src/github/appAuth.ts:77:20
     return Number(envInstallation);
   }
 
-  const cacheKey = owner.toLowerCase();
+  const cacheKey = owner.toUpperCase();
   const cached = installationCache.get(cacheKey);
   if (cached) {
killedBy: POST /tasks discovers installation id when env not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] ConditionalExpression
src/github/appAuth.ts:79:7
 
   const cacheKey = owner.toLowerCase();
   const cached = installationCache.get(cacheKey);
-  if (cached) {
+  if (true) {
     return cached;
   }
killedBy: POST /tasks discovers installation id when env not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] ConditionalExpression
src/github/appAuth.ts:79:7
 
   const cacheKey = owner.toLowerCase();
   const cached = installationCache.get(cacheKey);
-  if (cached) {
+  if (false) {
     return cached;
   }
killedBy: installation helpers fetches installation id when not cached
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] StringLiteral
src/github/appAuth.ts:84:40
   }
 
   const appId = getRequiredEnv('GITHUB_APP_ID');
-  const privateKeyB64 = getRequiredEnv('GITHUB_APP_PRIVATE_KEY');
+  const privateKeyB64 = getRequiredEnv("");
   const appJwt = buildAppJwt(appId, privateKeyB64);
 
killedBy: POST /tasks discovers installation id when env not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] ObjectLiteral
src/github/appAuth.ts:87:98
   const privateKeyB64 = getRequiredEnv('GITHUB_APP_PRIVATE_KEY');
   const appJwt = buildAppJwt(appId, privateKeyB64);
 
-  const installations = await githubRequest<Array<{ id: number; account?: { login?: string } }>>({
-    token: `Bearer ${appJwt}`,
-    method: 'GET',
-    url: '/app/installations',
-  });
+  const installations = await githubRequest<Array<{ id: number; account?: { login?: string } }>>({});
 
   const match = installations.find((installation) => installation.account?.login?.toLowerCase() === cacheKey);
killedBy: POST /tasks discovers installation id when env not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] StringLiteral
src/github/appAuth.ts:89:13
 
   const installations = await githubRequest<Array<{ id: number; account?: { login?: string } }>>({
     token: `Bearer ${appJwt}`,
-    method: 'GET',
+    method: "",
     url: '/app/installations',
   });
killedBy: POST /tasks discovers installation id when env not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] MethodExpression
src/github/appAuth.ts:93:54
     url: '/app/installations',
   });
 
-  const match = installations.find((installation) => installation.account?.login?.toLowerCase() === cacheKey);
+  const match = installations.find((installation) => installation.account?.login?.toUpperCase() === cacheKey);
   if (!match) {
     throw new Error(`No GitHub App installation found for owner ${owner}`);
killedBy: POST /tasks discovers installation id when env not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] ConditionalExpression
src/github/appAuth.ts:93:54
     url: '/app/installations',
   });
 
-  const match = installations.find((installation) => installation.account?.login?.toLowerCase() === cacheKey);
+  const match = installations.find((installation) => true);
   if (!match) {
     throw new Error(`No GitHub App installation found for owner ${owner}`);
killedBy: POST /tasks discovers installation id when env not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] BooleanLiteral
src/github/appAuth.ts:94:7
   });
 
   const match = installations.find((installation) => installation.account?.login?.toLowerCase() === cacheKey);
-  if (!match) {
+  if (match) {
     throw new Error(`No GitHub App installation found for owner ${owner}`);
   }
killedBy: POST /tasks discovers installation id when env not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] ConditionalExpression
src/github/appAuth.ts:94:7
   });
 
   const match = installations.find((installation) => installation.account?.login?.toLowerCase() === cacheKey);
-  if (!match) {
+  if (true) {
     throw new Error(`No GitHub App installation found for owner ${owner}`);
   }
killedBy: POST /tasks discovers installation id when env not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] StringLiteral
src/github/appAuth.ts:95:21
 
   const match = installations.find((installation) => installation.account?.login?.toLowerCase() === cacheKey);
   if (!match) {
-    throw new Error(`No GitHub App installation found for owner ${owner}`);
+    throw new Error(``);
   }
 
killedBy: installation helpers throws when installation not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "No GitHub App installation found for owner example"
Received message:   ""

      182 |       } else {
      183 |         stryCov_9fa48("67");
    > 184 |         throw new Error(stryMutAct_9fa48("68") ? `` : (stryCov_9fa48("68"), `No GitHub App installation found for owner ${owner}`));

[Killed] BlockStatement
src/github/appAuth.ts:102:85
   return match.id;
 }
 
-export async function getInstallationToken(installationId: number): Promise<string> {
-  const appId = getRequiredEnv('GITHUB_APP_ID');
-  const privateKeyB64 = getRequiredEnv('GITHUB_APP_PRIVATE_KEY');
-  const appJwt = buildAppJwt(appId, privateKeyB64);
-
-  const data = await githubRequest<{ token: string }>({
-    token: `Bearer ${appJwt}`,
-    method: 'POST',
-    url: `/app/installations/${installationId}/access_tokens`,
-  });
-
-  return data.token;
-}
+export async function getInstallationToken(installationId: number): Promise<string> {}
 
 export async function getInstallationTokenForOwner(owner: string): Promise<string> {
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
src/github/appAuth.ts:108:12
   const appJwt = buildAppJwt(appId, privateKeyB64);
 
   const data = await githubRequest<{ token: string }>({
-    token: `Bearer ${appJwt}`,
+    token: ``,
     method: 'POST',
     url: `/app/installations/${installationId}/access_tokens`,

[Killed] StringLiteral
src/github/appAuth.ts:109:13
 
   const data = await githubRequest<{ token: string }>({
     token: `Bearer ${appJwt}`,
-    method: 'POST',
+    method: "",
     url: `/app/installations/${installationId}/access_tokens`,
   });
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] StringLiteral
src/github/appAuth.ts:110:10
   const data = await githubRequest<{ token: string }>({
     token: `Bearer ${appJwt}`,
     method: 'POST',
-    url: `/app/installations/${installationId}/access_tokens`,
+    url: ``,
   });
 
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] BlockStatement
src/github/appAuth.ts:116:84
   return data.token;
 }
 
-export async function getInstallationTokenForOwner(owner: string): Promise<string> {
-  const installationId = await getInstallationId(owner);
-  return getInstallationToken(installationId);
-}
+export async function getInstallationTokenForOwner(owner: string): Promise<string> {}
 
 export function resetInstallationCache(): void {
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/github/appAuth.ts:121:48
   return getInstallationToken(installationId);
 }
 
-export function resetInstallationCache(): void {
-  installationCache.clear();
-}
+export function resetInstallationCache(): void {}
 
killedBy: installation helpers throws when installation not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: 999
