[Timeout] ObjectLiteral
src/routes/tasks.ts:15:36
   })
   .optional();
 
-const taskRequestSchema = z.object({
-  owner: z.string().min(1, 'owner is required'),
-  repo: z.string().min(1, 'repo is required'),
-  title: z.string().min(1, 'title is required'),
-  objective: z.string().min(1, 'objective is required'),
-  constraints: constraintsSchema,
-  testSpec: z.array(z.string()).optional(),
-  acceptance: z.array(z.string()).optional(),
-  labels: z.array(z.string()).optional(),
-});
+const taskRequestSchema = z.object({});
 
 function normalizeLabels(labels: string[] | undefined): string[] | undefined {

[Timeout] MethodExpression
src/routes/tasks.ts:16:10
   .optional();
 
 const taskRequestSchema = z.object({
-  owner: z.string().min(1, 'owner is required'),
+  owner: z.string().max(1, 'owner is required'),
   repo: z.string().min(1, 'repo is required'),
   title: z.string().min(1, 'title is required'),

[Timeout] StringLiteral
src/routes/tasks.ts:16:28
   .optional();
 
 const taskRequestSchema = z.object({
-  owner: z.string().min(1, 'owner is required'),
+  owner: z.string().min(1, ""),
   repo: z.string().min(1, 'repo is required'),
   title: z.string().min(1, 'title is required'),

[Killed] MethodExpression
src/routes/tasks.ts:17:9
 
 const taskRequestSchema = z.object({
   owner: z.string().min(1, 'owner is required'),
-  repo: z.string().min(1, 'repo is required'),
+  repo: z.string().max(1, 'repo is required'),
   title: z.string().min(1, 'title is required'),
   objective: z.string().min(1, 'objective is required'),
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Survived] StringLiteral
src/routes/tasks.ts:17:27
 
 const taskRequestSchema = z.object({
   owner: z.string().min(1, 'owner is required'),
-  repo: z.string().min(1, 'repo is required'),
+  repo: z.string().min(1, ""),
   title: z.string().min(1, 'title is required'),
   objective: z.string().min(1, 'objective is required'),

[Killed] MethodExpression
src/routes/tasks.ts:18:10
 const taskRequestSchema = z.object({
   owner: z.string().min(1, 'owner is required'),
   repo: z.string().min(1, 'repo is required'),
-  title: z.string().min(1, 'title is required'),
+  title: z.string().max(1, 'title is required'),
   objective: z.string().min(1, 'objective is required'),
   constraints: constraintsSchema,
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Survived] StringLiteral
src/routes/tasks.ts:18:28
 const taskRequestSchema = z.object({
   owner: z.string().min(1, 'owner is required'),
   repo: z.string().min(1, 'repo is required'),
-  title: z.string().min(1, 'title is required'),
+  title: z.string().min(1, ""),
   objective: z.string().min(1, 'objective is required'),
   constraints: constraintsSchema,

[Killed] MethodExpression
src/routes/tasks.ts:19:14
   owner: z.string().min(1, 'owner is required'),
   repo: z.string().min(1, 'repo is required'),
   title: z.string().min(1, 'title is required'),
-  objective: z.string().min(1, 'objective is required'),
+  objective: z.string().max(1, 'objective is required'),
   constraints: constraintsSchema,
   testSpec: z.array(z.string()).optional(),
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Timeout] BlockStatement
src/routes/tasks.ts:26:78
   labels: z.array(z.string()).optional(),
 });
 
-function normalizeLabels(labels: string[] | undefined): string[] | undefined {
-  if (!labels) {
-    return undefined;
-  }
-  const trimmed = labels.map((label) => label.trim()).filter((label) => label.length > 0);
-  return trimmed.length ? trimmed : undefined;
-}
+function normalizeLabels(labels: string[] | undefined): string[] | undefined {}
 
 export function registerTasksRoute(app: FastifyInstance): void {

[Killed] BlockStatement
src/routes/tasks.ts:27:16
 });
 
 function normalizeLabels(labels: string[] | undefined): string[] | undefined {
-  if (!labels) {
-    return undefined;
-  }
+  if (!labels) {}
   const trimmed = labels.map((label) => label.trim()).filter((label) => label.length > 0);
   return trimmed.length ? trimmed : undefined;
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] BooleanLiteral
src/routes/tasks.ts:27:7
 });
 
 function normalizeLabels(labels: string[] | undefined): string[] | undefined {
-  if (!labels) {
+  if (labels) {
     return undefined;
   }
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 502

[Killed] ConditionalExpression
src/routes/tasks.ts:30:73
   if (!labels) {
     return undefined;
   }
-  const trimmed = labels.map((label) => label.trim()).filter((label) => label.length > 0);
+  const trimmed = labels.map((label) => label.trim()).filter((label) => false);
   return trimmed.length ? trimmed : undefined;
 }
killedBy: POST /tasks adds ai-task label when not provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   "custom",
    "ai-task",

[Killed] ArrowFunction
src/routes/tasks.ts:30:62
   if (!labels) {
     return undefined;
   }
-  const trimmed = labels.map((label) => label.trim()).filter((label) => label.length > 0);
+  const trimmed = labels.map((label) => label.trim()).filter(() => undefined);
   return trimmed.length ? trimmed : undefined;
 }
killedBy: POST /tasks adds ai-task label when not provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   "custom",
    "ai-task",

[Killed] ConditionalExpression
src/routes/tasks.ts:37:9
 export function registerTasksRoute(app: FastifyInstance): void {
   app.post('/tasks', async (request, reply) => {
     const parseResult = taskRequestSchema.safeParse(request.body);
-    if (!parseResult.success) {
+    if (true) {
       return reply.code(400).send({
         status: 'error',
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BlockStatement
src/routes/tasks.ts:37:31
 export function registerTasksRoute(app: FastifyInstance): void {
   app.post('/tasks', async (request, reply) => {
     const parseResult = taskRequestSchema.safeParse(request.body);
-    if (!parseResult.success) {
-      return reply.code(400).send({
-        status: 'error',
-        message: parseResult.error.format(),
-      });
-    }
+    if (!parseResult.success) {}
 
     const payload = parseResult.data;
killedBy: POST /tasks returns 400 when required field missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 502

[Survived] StringLiteral
src/routes/tasks.ts:39:17
     const parseResult = taskRequestSchema.safeParse(request.body);
     if (!parseResult.success) {
       return reply.code(400).send({
-        status: 'error',
+        status: "",
         message: parseResult.error.format(),
       });

[Killed] BlockStatement
src/routes/tasks.ts:46:9
 
     const payload = parseResult.data;
 
-    try {
-      const result = await createAgentIssue({
-        owner: payload.owner,
-        repo: payload.repo,
-        title: payload.title,
-        objective: payload.objective,
-        constraints: payload.constraints,
-        testSpec: payload.testSpec,
-        acceptance: payload.acceptance,
-        labels: normalizeLabels(payload.labels),
-      });
-
-      return reply.code(201).send({
-        issue_number: result.issueNumber,
-        issue_url: result.issueUrl,
-      });
-    } catch (error) {
+    try {} catch (error) {
       request.log.error({ err: error }, 'failed to create GitHub issue');
       return reply.code(502).send({ status: 'error', message: 'Failed to create GitHub issue' });
killedBy: POST /tasks valid input returns 201 with issue details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 200

[Killed] BlockStatement
src/routes/tasks.ts:62:21
         issue_number: result.issueNumber,
         issue_url: result.issueUrl,
       });
-    } catch (error) {
-      request.log.error({ err: error }, 'failed to create GitHub issue');
-      return reply.code(502).send({ status: 'error', message: 'Failed to create GitHub issue' });
-    }
+    } catch (error) {}
   });
 }
killedBy: POST /tasks returns 502 when GitHub issue creation fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 502
Received: 200

[Survived] ObjectLiteral
src/routes/tasks.ts:64:35
       });
     } catch (error) {
       request.log.error({ err: error }, 'failed to create GitHub issue');
-      return reply.code(502).send({ status: 'error', message: 'Failed to create GitHub issue' });
+      return reply.code(502).send({});
     }
   });

[Survived] StringLiteral
src/routes/tasks.ts:64:63
       });
     } catch (error) {
       request.log.error({ err: error }, 'failed to create GitHub issue');
-      return reply.code(502).send({ status: 'error', message: 'Failed to create GitHub issue' });
+      return reply.code(502).send({ status: 'error', message: "" });
     }
   });
