[Survived] StringLiteral
src/state/store.ts:41:3
   'test',
   'codeql',
   'sboms-orchestrator',
-  'Attest build provenance (Orchestrator)'
+  ""
 ];
 

[Survived] ArithmeticOperator
src/state/store.ts:44:24
   'Attest build provenance (Orchestrator)'
 ];
 
-const DEFAULT_TTL_MS = 24 * 60 * 60 * 1000; // 24h
+const DEFAULT_TTL_MS = 24 / 60 * 60 * 1000; // 24h
 
 const store = new Map<number, TaskRecord>();

[Survived] ArithmeticOperator
src/state/store.ts:44:24
   'Attest build provenance (Orchestrator)'
 ];
 
-const DEFAULT_TTL_MS = 24 * 60 * 60 * 1000; // 24h
+const DEFAULT_TTL_MS = 24 * 60 * 60 / 1000; // 24h
 
 const store = new Map<number, TaskRecord>();

[Survived] BlockStatement
src/state/store.ts:48:37
 
 const store = new Map<number, TaskRecord>();
 
-function ensure(record: TaskRecord) {
-  record.updatedAt = Date.now();
-  record.ttlAt = record.updatedAt + DEFAULT_TTL_MS;
-}
+function ensure(record: TaskRecord) {}
 
 export function getTask(issue_number: number): TaskRecord | undefined {

[Survived] ArithmeticOperator
src/state/store.ts:50:18
 
 function ensure(record: TaskRecord) {
   record.updatedAt = Date.now();
-  record.ttlAt = record.updatedAt + DEFAULT_TTL_MS;
+  record.ttlAt = record.updatedAt - DEFAULT_TTL_MS;
 }
 

[Killed] BlockStatement
src/state/store.ts:53:71
   record.ttlAt = record.updatedAt + DEFAULT_TTL_MS;
 }
 
-export function getTask(issue_number: number): TaskRecord | undefined {
-  const rec = store.get(issue_number);
-  if (!rec) return undefined;
-  if (Date.now() > rec.ttlAt) return rec; // do not auto-delete to keep debugging window
-  return rec;
-}
+export function getTask(issue_number: number): TaskRecord | undefined {}
 
 export function upsertTask(base: {
killedBy: handlers branch coverage issues closed with merged true -> MERGED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MERGED"
Received: undefined

[Killed] ConditionalExpression
src/state/store.ts:55:7
 
 export function getTask(issue_number: number): TaskRecord | undefined {
   const rec = store.get(issue_number);
-  if (!rec) return undefined;
+  if (false) return undefined;
   if (Date.now() > rec.ttlAt) return rec; // do not auto-delete to keep debugging window
   return rec;
killedBy: server GET /tasks branches returns 400 for invalid issue number and 404 when not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] BooleanLiteral
src/state/store.ts:55:7
 
 export function getTask(issue_number: number): TaskRecord | undefined {
   const rec = store.get(issue_number);
-  if (!rec) return undefined;
+  if (rec) return undefined;
   if (Date.now() > rec.ttlAt) return rec; // do not auto-delete to keep debugging window
   return rec;
killedBy: webhooks + state accepts issues opened and creates CREATED state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Survived] EqualityOperator
src/state/store.ts:56:7
 export function getTask(issue_number: number): TaskRecord | undefined {
   const rec = store.get(issue_number);
   if (!rec) return undefined;
-  if (Date.now() > rec.ttlAt) return rec; // do not auto-delete to keep debugging window
+  if (Date.now() >= rec.ttlAt) return rec; // do not auto-delete to keep debugging window
   return rec;
 }

[Survived] ConditionalExpression
src/state/store.ts:56:7
 export function getTask(issue_number: number): TaskRecord | undefined {
   const rec = store.get(issue_number);
   if (!rec) return undefined;
-  if (Date.now() > rec.ttlAt) return rec; // do not auto-delete to keep debugging window
+  if (true) return rec; // do not auto-delete to keep debugging window
   return rec;
 }

[Killed] ConditionalExpression
src/state/store.ts:66:7
 }): TaskRecord {
   const now = Date.now();
   const existing = store.get(base.issue_number);
-  if (existing) {
+  if (true) {
     existing.repo = base.repo;
     existing.updatedAt = now;
killedBy: webhooks + state accepts issues opened and creates CREATED state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
src/state/store.ts:66:17
 }): TaskRecord {
   const now = Date.now();
   const existing = store.get(base.issue_number);
-  if (existing) {
-    existing.repo = base.repo;
-    existing.updatedAt = now;
-    existing.ttlAt = now + DEFAULT_TTL_MS;
-    return existing;
-  }
+  if (existing) {}
   const record: TaskRecord = {
     issue_number: base.issue_number,
killedBy: coverage extras for store/router/handlers workflow_run success can flip CHECKS_GREEN when all checks true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_GREEN"
Received: "CREATED"

[Survived] ArithmeticOperator
src/state/store.ts:69:22
   if (existing) {
     existing.repo = base.repo;
     existing.updatedAt = now;
-    existing.ttlAt = now + DEFAULT_TTL_MS;
+    existing.ttlAt = now - DEFAULT_TTL_MS;
     return existing;
   }

[Killed] ArrowFunction
src/state/store.ts:79:57
     pr_number: undefined,
     checks: {
       required: [...REQUIRED_CHECKS],
-      completed: Object.fromEntries(REQUIRED_CHECKS.map((n) => [n, false])),
+      completed: Object.fromEntries(REQUIRED_CHECKS.map(() => undefined)),
       green: false,
     },
killedBy: webhooks + state accepts issues opened and creates CREATED state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BooleanLiteral
src/state/store.ts:79:68
     pr_number: undefined,
     checks: {
       required: [...REQUIRED_CHECKS],
-      completed: Object.fromEntries(REQUIRED_CHECKS.map((n) => [n, false])),
+      completed: Object.fromEntries(REQUIRED_CHECKS.map((n) => [n, true])),
       green: false,
     },
killedBy: coverage extras for store/router/handlers setCheck ignores unknown check names (branch)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/state/store.ts:80:14
     checks: {
       required: [...REQUIRED_CHECKS],
       completed: Object.fromEntries(REQUIRED_CHECKS.map((n) => [n, false])),
-      green: false,
+      green: true,
     },
     timeline: [],
killedBy: coverage extras for store/router/handlers setCheck ignores unknown check names (branch)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ArithmeticOperator
src/state/store.ts:84:12
     },
     timeline: [],
     updatedAt: now,
-    ttlAt: now + DEFAULT_TTL_MS,
+    ttlAt: now - DEFAULT_TTL_MS,
   };
   store.set(base.issue_number, record);

[Survived] BlockStatement
src/state/store.ts:90:92
   return record;
 }
 
-export function addEvent(issue_number: number, evt: TimelineEvent): TaskRecord | undefined {
-  const rec = store.get(issue_number);
-  if (!rec) return undefined;
-  rec.timeline.push(evt);
-  ensure(rec);
-  return rec;
-}
+export function addEvent(issue_number: number, evt: TimelineEvent): TaskRecord | undefined {}
 
 export function setState(issue_number: number, state: TaskStateName): TaskRecord | undefined {

[Killed] BlockStatement
src/state/store.ts:98:94
   return rec;
 }
 
-export function setState(issue_number: number, state: TaskStateName): TaskRecord | undefined {
-  const rec = store.get(issue_number);
-  if (!rec) return undefined;
-  rec.state = state;
-  ensure(rec);
-  return rec;
-}
+export function setState(issue_number: number, state: TaskStateName): TaskRecord | undefined {}
 
 export function setPr(issue_number: number, pr_number: number): TaskRecord | undefined {
killedBy: workflow_run inference via head_commit.message and head_branch infers issue number from head commit message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "CREATED"

[Killed] ConditionalExpression
src/state/store.ts:100:7
 
 export function setState(issue_number: number, state: TaskStateName): TaskRecord | undefined {
   const rec = store.get(issue_number);
-  if (!rec) return undefined;
+  if (true) return undefined;
   rec.state = state;
   ensure(rec);
killedBy: workflow_run inference via head_commit.message and head_branch infers issue number from head commit message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "CREATED"

[Killed] BlockStatement
src/state/store.ts:106:88
   return rec;
 }
 
-export function setPr(issue_number: number, pr_number: number): TaskRecord | undefined {
-  const rec = store.get(issue_number);
-  if (!rec) return undefined;
-  rec.pr_number = pr_number;
-  ensure(rec);
-  return rec;
-}
+export function setPr(issue_number: number, pr_number: number): TaskRecord | undefined {}
 
 export function setCheck(issue_number: number, checkName: string, ok: boolean): TaskRecord | undefined {
killedBy: handlers branch coverage pull_request ready_for_review -> PR_OPEN (fallback to pr number)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 811
Received: undefined

[Killed] BlockStatement
src/state/store.ts:114:104
   return rec;
 }
 
-export function setCheck(issue_number: number, checkName: string, ok: boolean): TaskRecord | undefined {
-  const rec = store.get(issue_number);
-  if (!rec) return undefined;
-  if (rec.checks.required.includes(checkName)) {
-    rec.checks.completed[checkName] = ok;
-  }
-  rec.checks.green = rec.checks.required.every((n) => rec.checks.completed[n] === true);
-  ensure(rec);
-  return rec;
-}
+export function setCheck(issue_number: number, checkName: string, ok: boolean): TaskRecord | undefined {}
 
killedBy: coverage extras for store/router/handlers workflow_run success can flip CHECKS_GREEN when all checks true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_GREEN"
Received: "CREATED"

[Killed] ConditionalExpression
src/state/store.ts:117:7
 export function setCheck(issue_number: number, checkName: string, ok: boolean): TaskRecord | undefined {
   const rec = store.get(issue_number);
   if (!rec) return undefined;
-  if (rec.checks.required.includes(checkName)) {
+  if (false) {
     rec.checks.completed[checkName] = ok;
   }
killedBy: state store + handlers set state and pr and checks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/state/store.ts:117:7
 export function setCheck(issue_number: number, checkName: string, ok: boolean): TaskRecord | undefined {
   const rec = store.get(issue_number);
   if (!rec) return undefined;
-  if (rec.checks.required.includes(checkName)) {
+  if (true) {
     rec.checks.completed[checkName] = ok;
   }
killedBy: webhooks + state workflow_run success flips required check and can become CHECKS_GREEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/state/store.ts:120:55
   if (rec.checks.required.includes(checkName)) {
     rec.checks.completed[checkName] = ok;
   }
-  rec.checks.green = rec.checks.required.every((n) => rec.checks.completed[n] === true);
+  rec.checks.green = rec.checks.required.every((n) => true);
   ensure(rec);
   return rec;
killedBy: webhooks + state workflow_run success flips required check and can become CHECKS_GREEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] EqualityOperator
src/state/store.ts:120:55
   if (rec.checks.required.includes(checkName)) {
     rec.checks.completed[checkName] = ok;
   }
-  rec.checks.green = rec.checks.required.every((n) => rec.checks.completed[n] === true);
+  rec.checks.green = rec.checks.required.every((n) => rec.checks.completed[n] !== true);
   ensure(rec);
   return rec;
killedBy: coverage extras for store/router/handlers setCheck ignores unknown check names (branch)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
