[Killed] ConditionalExpression
src/webhooks/handlers/pull_request.ts:6:7
 export function handlePullRequestEvent(event: any) {
   const action = event.action as string;
   const pr = event.pull_request;
-  if (!pr) return;
+  if (true) return;
   const pr_number = pr.number as number;
   const repo = event.repository?.full_name as string;
killedBy: handlers branch coverage pull_request ready_for_review -> PR_OPEN (fallback to pr number)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PR_OPEN"
Received: undefined

[Killed] ConditionalExpression
src/webhooks/handlers/pull_request.ts:6:7
 export function handlePullRequestEvent(event: any) {
   const action = event.action as string;
   const pr = event.pull_request;
-  if (!pr) return;
+  if (false) return;
   const pr_number = pr.number as number;
   const repo = event.repository?.full_name as string;
killedBy: handlers early return branches handlePullRequestEvent early returns when payload missing pr
statusReason: TypeError: Cannot read properties of undefined (reading 'number')

[Killed] BlockStatement
src/webhooks/handlers/pull_request.ts:11:57
   const repo = event.repository?.full_name as string;
 
   // Derive issue number from PR title or body references if present; fallback to PR number as surrogate
-  const refFrom = (str?: string): number | undefined => {
-    if (!str) return undefined;
-    const m = str.match(/#(\d+)/);
-    return m ? Number(m[1]) : undefined;
-  };
+  const refFrom = (str?: string): number | undefined => {};
   const linkedFromTitle = refFrom(pr.title);
   const linkedFromBody = refFrom(pr.body);
killedBy: handlers branch coverage pull_request closed merged true -> MERGED for referenced issue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MERGED"
Received: undefined

[Killed] ConditionalExpression
src/webhooks/handlers/pull_request.ts:12:9
 
   // Derive issue number from PR title or body references if present; fallback to PR number as surrogate
   const refFrom = (str?: string): number | undefined => {
-    if (!str) return undefined;
+    if (true) return undefined;
     const m = str.match(/#(\d+)/);
     return m ? Number(m[1]) : undefined;
killedBy: handlers branch coverage pull_request closed merged true -> MERGED for referenced issue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MERGED"
Received: undefined

[Killed] BooleanLiteral
src/webhooks/handlers/pull_request.ts:12:9
 
   // Derive issue number from PR title or body references if present; fallback to PR number as surrogate
   const refFrom = (str?: string): number | undefined => {
-    if (!str) return undefined;
+    if (str) return undefined;
     const m = str.match(/#(\d+)/);
     return m ? Number(m[1]) : undefined;
killedBy: handlers branch coverage pull_request ready_for_review -> PR_OPEN (fallback to pr number)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PR_OPEN"
Received: undefined

[Killed] LogicalOperator
src/webhooks/handlers/pull_request.ts:18:32
   };
   const linkedFromTitle = refFrom(pr.title);
   const linkedFromBody = refFrom(pr.body);
-  const issue_number: number = linkedFromTitle ?? linkedFromBody ?? pr_number;
+  const issue_number: number = (linkedFromTitle ?? linkedFromBody) && pr_number;
 
   upsertTask({ issue_number, repo });
killedBy: handlers branch coverage pull_request ready_for_review -> PR_OPEN (fallback to pr number)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PR_OPEN"
Received: undefined

[Killed] LogicalOperator
src/webhooks/handlers/pull_request.ts:18:32
   };
   const linkedFromTitle = refFrom(pr.title);
   const linkedFromBody = refFrom(pr.body);
-  const issue_number: number = linkedFromTitle ?? linkedFromBody ?? pr_number;
+  const issue_number: number = linkedFromTitle && linkedFromBody ?? pr_number;
 
   upsertTask({ issue_number, repo });
killedBy: handlers branch coverage pull_request closed merged true -> MERGED for referenced issue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MERGED"
Received: undefined

[Killed] ObjectLiteral
src/webhooks/handlers/pull_request.ts:20:14
   const linkedFromBody = refFrom(pr.body);
   const issue_number: number = linkedFromTitle ?? linkedFromBody ?? pr_number;
 
-  upsertTask({ issue_number, repo });
+  upsertTask({});
   setPr(issue_number, pr_number);
 
killedBy: handlers branch coverage pull_request ready_for_review -> PR_OPEN (fallback to pr number)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PR_OPEN"
Received: undefined

[Killed] EqualityOperator
src/webhooks/handlers/pull_request.ts:23:7
   upsertTask({ issue_number, repo });
   setPr(issue_number, pr_number);
 
-  if (action === 'opened' || action === 'synchronize' || action === 'ready_for_review') {
+  if (action !== 'opened' || action === 'synchronize' || action === 'ready_for_review') {
     setState(issue_number, 'PR_OPEN');
   }
killedBy: webhooks + state pull_request opened → PR_OPEN with linkage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PR_OPEN"
Received: "CREATED"

[Killed] ConditionalExpression
src/webhooks/handlers/pull_request.ts:23:58
   upsertTask({ issue_number, repo });
   setPr(issue_number, pr_number);
 
-  if (action === 'opened' || action === 'synchronize' || action === 'ready_for_review') {
+  if (action === 'opened' || action === 'synchronize' || false) {
     setState(issue_number, 'PR_OPEN');
   }
killedBy: handlers branch coverage pull_request ready_for_review -> PR_OPEN (fallback to pr number)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PR_OPEN"
Received: "CREATED"

[Timeout] BlockStatement
src/webhooks/handlers/pull_request.ts:27:28
     setState(issue_number, 'PR_OPEN');
   }
 
-  if (action === 'closed') {
-    if (pr.merged) {
-      setState(issue_number, 'MERGED');
-    } else {
-      setState(issue_number, 'FAILED');
-    }
-  }
+  if (action === 'closed') {}
 
   addEvent(issue_number, { ts: Date.now(), event: 'pull_request', action, pr_number });

[Timeout] ConditionalExpression
src/webhooks/handlers/pull_request.ts:27:7
     setState(issue_number, 'PR_OPEN');
   }
 
-  if (action === 'closed') {
+  if (false) {
     if (pr.merged) {
       setState(issue_number, 'MERGED');

[Killed] ConditionalExpression
src/webhooks/handlers/pull_request.ts:28:9
   }
 
   if (action === 'closed') {
-    if (pr.merged) {
+    if (true) {
       setState(issue_number, 'MERGED');
     } else {
killedBy: issues closed not merged -> FAILED marks task FAILED when issue closed without merge
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FAILED"
Received: "MERGED"

[Killed] ConditionalExpression
src/webhooks/handlers/pull_request.ts:28:9
   }
 
   if (action === 'closed') {
-    if (pr.merged) {
+    if (false) {
       setState(issue_number, 'MERGED');
     } else {
killedBy: handlers branch coverage pull_request closed merged true -> MERGED for referenced issue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MERGED"
Received: "FAILED"

[Killed] StringLiteral
src/webhooks/handlers/pull_request.ts:29:30
 
   if (action === 'closed') {
     if (pr.merged) {
-      setState(issue_number, 'MERGED');
+      setState(issue_number, "");
     } else {
       setState(issue_number, 'FAILED');
killedBy: handlers branch coverage pull_request closed merged true -> MERGED for referenced issue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MERGED"
Received: ""
