[Killed] BooleanLiteral
src/webhooks/handlers/workflow_run.ts:6:7
 export function handleWorkflowRunEvent(event: any) {
   const action = event.action as string;
   const wr = event.workflow_run;
-  if (!wr) return;
+  if (wr) return;
   const name = wr.name as string; // should match required checks names
   const conclusion = wr.conclusion as string | undefined; // success or failure
killedBy: webhooks + state workflow_run success flips required check and can become CHECKS_GREEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/webhooks/handlers/workflow_run.ts:6:7
 export function handleWorkflowRunEvent(event: any) {
   const action = event.action as string;
   const wr = event.workflow_run;
-  if (!wr) return;
+  if (false) return;
   const name = wr.name as string; // should match required checks names
   const conclusion = wr.conclusion as string | undefined; // success or failure
killedBy: webhooks + state workflow_run success flips required check and can become CHECKS_GREEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
src/webhooks/handlers/workflow_run.ts:17:31
   const title = wr.display_title as string | undefined;
   const msg = wr.head_commit?.message as string | undefined;
   const candidates = [title, msg, head_branch].filter(Boolean) as string[];
-  for (const c of candidates) {
-    const m = c.match(/#(\d+)/);
-    if (m) { issue_number = Number(m[1]); break; }
-  }
+  for (const c of candidates) {}
   if (!issue_number) return;
 
killedBy: webhooks + state workflow_run success flips required check and can become CHECKS_GREEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/webhooks/handlers/workflow_run.ts:19:9
   const candidates = [title, msg, head_branch].filter(Boolean) as string[];
   for (const c of candidates) {
     const m = c.match(/#(\d+)/);
-    if (m) { issue_number = Number(m[1]); break; }
+    if (false) { issue_number = Number(m[1]); break; }
   }
   if (!issue_number) return;
killedBy: webhooks + state workflow_run success flips required check and can become CHECKS_GREEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/webhooks/handlers/workflow_run.ts:19:9
   const candidates = [title, msg, head_branch].filter(Boolean) as string[];
   for (const c of candidates) {
     const m = c.match(/#(\d+)/);
-    if (m) { issue_number = Number(m[1]); break; }
+    if (true) { issue_number = Number(m[1]); break; }
   }
   if (!issue_number) return;
killedBy: webhooks + state workflow_run success flips required check and can become CHECKS_GREEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/webhooks/handlers/workflow_run.ts:21:7
     const m = c.match(/#(\d+)/);
     if (m) { issue_number = Number(m[1]); break; }
   }
-  if (!issue_number) return;
+  if (false) return;
 
   const rec = upsertTask({ issue_number, repo });
killedBy: webhooks + state workflow_run success flips required check and can become CHECKS_GREEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/webhooks/handlers/workflow_run.ts:21:7
     const m = c.match(/#(\d+)/);
     if (m) { issue_number = Number(m[1]); break; }
   }
-  if (!issue_number) return;
+  if (true) return;
 
   const rec = upsertTask({ issue_number, repo });
killedBy: webhooks + state workflow_run success flips required check and can become CHECKS_GREEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/webhooks/handlers/workflow_run.ts:24:7
   if (!issue_number) return;
 
   const rec = upsertTask({ issue_number, repo });
-  if (conclusion) {
+  if (false) {
     const ok = conclusion === 'success';
     setCheck(issue_number, name, ok);
killedBy: workflow_run inference via head_commit.message and head_branch infers issue number from head commit message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "CREATED"

[Killed] ConditionalExpression
src/webhooks/handlers/workflow_run.ts:24:7
   if (!issue_number) return;
 
   const rec = upsertTask({ issue_number, repo });
-  if (conclusion) {
+  if (true) {
     const ok = conclusion === 'success';
     setCheck(issue_number, name, ok);
killedBy: webhooks + state workflow_run success flips required check and can become CHECKS_GREEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/webhooks/handlers/workflow_run.ts:25:16
 
   const rec = upsertTask({ issue_number, repo });
   if (conclusion) {
-    const ok = conclusion === 'success';
+    const ok = true;
     setCheck(issue_number, name, ok);
     if (rec.checks.green) {
killedBy: webhooks + state workflow_run success flips required check and can become CHECKS_GREEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
src/webhooks/handlers/workflow_run.ts:27:27
   if (conclusion) {
     const ok = conclusion === 'success';
     setCheck(issue_number, name, ok);
-    if (rec.checks.green) {
-      setState(issue_number, 'CHECKS_GREEN');
-    } else if (!ok) {
+    if (rec.checks.green) {} else if (!ok) {
       setState(issue_number, 'CHECKS_RED');
     }
killedBy: coverage extras for store/router/handlers workflow_run success can flip CHECKS_GREEN when all checks true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_GREEN"
Received: "CREATED"

[Killed] StringLiteral
src/webhooks/handlers/workflow_run.ts:28:30
     const ok = conclusion === 'success';
     setCheck(issue_number, name, ok);
     if (rec.checks.green) {
-      setState(issue_number, 'CHECKS_GREEN');
+      setState(issue_number, "");
     } else if (!ok) {
       setState(issue_number, 'CHECKS_RED');
killedBy: coverage extras for store/router/handlers workflow_run success can flip CHECKS_GREEN when all checks true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_GREEN"
Received: ""

[Killed] ConditionalExpression
src/webhooks/handlers/workflow_run.ts:29:16
     setCheck(issue_number, name, ok);
     if (rec.checks.green) {
       setState(issue_number, 'CHECKS_GREEN');
-    } else if (!ok) {
+    } else if (false) {
       setState(issue_number, 'CHECKS_RED');
     }
killedBy: webhooks + state workflow_run success flips required check and can become CHECKS_GREEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BooleanLiteral
src/webhooks/handlers/workflow_run.ts:29:16
     setCheck(issue_number, name, ok);
     if (rec.checks.green) {
       setState(issue_number, 'CHECKS_GREEN');
-    } else if (!ok) {
+    } else if (ok) {
       setState(issue_number, 'CHECKS_RED');
     }
killedBy: webhooks + state workflow_run success flips required check and can become CHECKS_GREEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] StringLiteral
src/webhooks/handlers/workflow_run.ts:33:51
       setState(issue_number, 'CHECKS_RED');
     }
   }
-  addEvent(issue_number, { ts: Date.now(), event: 'workflow_run', action, check_name: name, conclusion });
+  addEvent(issue_number, { ts: Date.now(), event: "", action, check_name: name, conclusion });
 }
 
killedBy: webhooks + state workflow_run success flips required check and can become CHECKS_GREEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404
