[Killed] ConditionalExpression
src/webhooks/router.ts:9:5
 
 export function routeGithubEvent(event: string, payload: any) {
   switch (event) {
-    case 'issues':
-      return handleIssuesEvent(payload);
+    case 'issues':
     case 'issue_comment':
       // Move to IN_PROGRESS on any agent-like comment
killedBy: webhooks + state accepts issues opened and creates CREATED state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] StringLiteral
src/webhooks/router.ts:9:10
 
 export function routeGithubEvent(event: string, payload: any) {
   switch (event) {
-    case 'issues':
+    case "":
       return handleIssuesEvent(payload);
     case 'issue_comment':
killedBy: webhooks + state accepts issues opened and creates CREATED state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/webhooks/router.ts:11:5
   switch (event) {
     case 'issues':
       return handleIssuesEvent(payload);
-    case 'issue_comment':
-      // Move to IN_PROGRESS on any agent-like comment
-      try {
-        const issue = payload.issue;
-        const body: string | undefined = payload.comment?.body;
-        if (issue && body && /plan|steps|agent/i.test(body)) {
-          // handler inline to avoid cycle; import lazily
-          const { setState, upsertTask, addEvent } = require('../state/store');
-          upsertTask({ issue_number: issue.number, repo: payload.repository?.full_name });
-          setState(issue.number, 'IN_PROGRESS');
-          addEvent(issue.number, { ts: Date.now(), event: 'issue_comment', action: 'created' });
-        }
-      } catch {
-        // noop
-      }
-      return;
+    case 'issue_comment':
     case 'pull_request':
       return handlePullRequestEvent(payload);
killedBy: coverage extras for store/router/handlers issue_comment with agent-like body moves to IN_PROGRESS
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "IN_PROGRESS"
Received: "CREATED"

[Killed] BlockStatement
src/webhooks/router.ts:13:11
       return handleIssuesEvent(payload);
     case 'issue_comment':
       // Move to IN_PROGRESS on any agent-like comment
-      try {
-        const issue = payload.issue;
-        const body: string | undefined = payload.comment?.body;
-        if (issue && body && /plan|steps|agent/i.test(body)) {
-          // handler inline to avoid cycle; import lazily
-          const { setState, upsertTask, addEvent } = require('../state/store');
-          upsertTask({ issue_number: issue.number, repo: payload.repository?.full_name });
-          setState(issue.number, 'IN_PROGRESS');
-          addEvent(issue.number, { ts: Date.now(), event: 'issue_comment', action: 'created' });
-        }
-      } catch {
+      try {} catch {
         // noop
       }
killedBy: coverage extras for store/router/handlers issue_comment with agent-like body moves to IN_PROGRESS
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "IN_PROGRESS"
Received: "CREATED"

[Survived] OptionalChaining
src/webhooks/router.ts:15:42
       // Move to IN_PROGRESS on any agent-like comment
       try {
         const issue = payload.issue;
-        const body: string | undefined = payload.comment?.body;
+        const body: string | undefined = payload.comment.body;
         if (issue && body && /plan|steps|agent/i.test(body)) {
           // handler inline to avoid cycle; import lazily

[Killed] ConditionalExpression
src/webhooks/router.ts:16:13
       try {
         const issue = payload.issue;
         const body: string | undefined = payload.comment?.body;
-        if (issue && body && /plan|steps|agent/i.test(body)) {
+        if (false) {
           // handler inline to avoid cycle; import lazily
           const { setState, upsertTask, addEvent } = require('../state/store');
killedBy: coverage extras for store/router/handlers issue_comment with agent-like body moves to IN_PROGRESS
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "IN_PROGRESS"
Received: "CREATED"

[Killed] BlockStatement
src/webhooks/router.ts:16:62
       try {
         const issue = payload.issue;
         const body: string | undefined = payload.comment?.body;
-        if (issue && body && /plan|steps|agent/i.test(body)) {
-          // handler inline to avoid cycle; import lazily
-          const { setState, upsertTask, addEvent } = require('../state/store');
-          upsertTask({ issue_number: issue.number, repo: payload.repository?.full_name });
-          setState(issue.number, 'IN_PROGRESS');
-          addEvent(issue.number, { ts: Date.now(), event: 'issue_comment', action: 'created' });
-        }
+        if (issue && body && /plan|steps|agent/i.test(body)) {}
       } catch {
         // noop
killedBy: coverage extras for store/router/handlers issue_comment with agent-like body moves to IN_PROGRESS
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "IN_PROGRESS"
Received: "CREATED"

[Survived] OptionalChaining
src/webhooks/router.ts:19:58
         if (issue && body && /plan|steps|agent/i.test(body)) {
           // handler inline to avoid cycle; import lazily
           const { setState, upsertTask, addEvent } = require('../state/store');
-          upsertTask({ issue_number: issue.number, repo: payload.repository?.full_name });
+          upsertTask({ issue_number: issue.number, repo: payload.repository.full_name });
           setState(issue.number, 'IN_PROGRESS');
           addEvent(issue.number, { ts: Date.now(), event: 'issue_comment', action: 'created' });

[Survived] StringLiteral
src/webhooks/router.ts:21:59
           const { setState, upsertTask, addEvent } = require('../state/store');
           upsertTask({ issue_number: issue.number, repo: payload.repository?.full_name });
           setState(issue.number, 'IN_PROGRESS');
-          addEvent(issue.number, { ts: Date.now(), event: 'issue_comment', action: 'created' });
+          addEvent(issue.number, { ts: Date.now(), event: "", action: 'created' });
         }
       } catch {

[Killed] ConditionalExpression
src/webhooks/router.ts:27:5
         // noop
       }
       return;
-    case 'pull_request':
-      return handlePullRequestEvent(payload);
+    case 'pull_request':
     case 'check_run':
       return handleCheckRunEvent(payload);
killedBy: webhooks + state pull_request opened → PR_OPEN with linkage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] StringLiteral
src/webhooks/router.ts:27:10
         // noop
       }
       return;
-    case 'pull_request':
+    case "":
       return handlePullRequestEvent(payload);
     case 'check_run':
killedBy: webhooks + state pull_request opened → PR_OPEN with linkage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/webhooks/router.ts:29:5
       return;
     case 'pull_request':
       return handlePullRequestEvent(payload);
-    case 'check_run':
-      return handleCheckRunEvent(payload);
+    case 'check_run':
     case 'workflow_run':
       return handleWorkflowRunEvent(payload);
killedBy: handlers branch coverage check_run timed_out -> CHECKS_RED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: "PR_OPEN"

[Killed] ConditionalExpression
src/webhooks/router.ts:31:5
       return handlePullRequestEvent(payload);
     case 'check_run':
       return handleCheckRunEvent(payload);
-    case 'workflow_run':
-      return handleWorkflowRunEvent(payload);
+    case 'workflow_run':
     default:
       return; // ignore others
killedBy: workflow_run inference via head_commit.message and head_branch infers issue number from head commit message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: undefined

[Killed] StringLiteral
src/webhooks/router.ts:31:10
       return handlePullRequestEvent(payload);
     case 'check_run':
       return handleCheckRunEvent(payload);
-    case 'workflow_run':
+    case "":
       return handleWorkflowRunEvent(payload);
     default:
killedBy: workflow_run inference via head_commit.message and head_branch infers issue number from head commit message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CHECKS_RED"
Received: undefined

[Survived] ConditionalExpression
src/webhooks/router.ts:33:5
       return handleCheckRunEvent(payload);
     case 'workflow_run':
       return handleWorkflowRunEvent(payload);
-    default:
-      return; // ignore others
+    default: // ignore others // ignore others
   }
 }
